Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xC.h
typedef struct
{
   __IO uint32_t MACCR;            /*!< ETH MACCR Register,                 Address offset: 0x0000  */
   __IO uint32_t MACFFR;           /*!< ETH MACFFR Register,                Address offset: 0x0004  */
   __IO uint32_t MACHTHR;          /*!< ETH MACHTHR Register,               Address offset: 0x0008  */
   __IO uint32_t MACHTLR;          /*!< ETH MACHTLR Register,               Address offset: 0x000C  */
   __IO uint32_t MACMIIAR;         /*!< ETH MACMIIAR Register,              Address offset: 0x0010  */
   __IO uint32_t MACMIIDR;         /*!< ETH MACMIIDR Register,              Address offset: 0x0014  */
   __IO uint32_t MACFCR;           /*!< ETH MACFCR Register,                Address offset: 0x0018  */
   __IO uint32_t MACVLANTR;        /*!< ETH MACVLANTR Register,             Address offset: 0x001C  */
   __IO uint32_t RESERVED1[2];      
   __IO uint32_t MACRWUFFR;        /*!< ETH MACRWUFFR Register,             Address offset: 0x0028  */
   __IO uint32_t MACPMTCSR;        /*!< ETH MACPMTCSR Register,             Address offset: 0x002C  */
   __IO uint32_t RESERVED2[2];      
   __IO uint32_t MACSR;            /*!< ETH MACSR Register,                 Address offset: 0x0038  */
   __IO uint32_t MACIMR;           /*!< ETH MACIMR Register,                Address offset: 0x003C  */     
   __IO uint32_t MACA0HR;          /*!< ETH MACA0HR Register,               Address offset: 0x0040  */
   __IO uint32_t MACA0LR;          /*!< ETH MACA0LR Register,               Address offset: 0x0044  */
   __IO uint32_t MACA1HR;          /*!< ETH MACA1HR Register,               Address offset: 0x0048  */
   __IO uint32_t MACA1LR;          /*!< ETH MACA1LR Register,               Address offset: 0x004C  */
   __IO uint32_t MACA2HR;          /*!< ETH MACA2HR Register,               Address offset: 0x0050  */
   __IO uint32_t MACA2LR;          /*!< ETH MACA2LR Register,               Address offset: 0x0054  */
   __IO uint32_t MACA3HR;          /*!< ETH MACA3HR Register,               Address offset: 0x0058  */
   __IO uint32_t MACA3LR;          /*!< ETH MACA3LR Register,               Address offset: 0x005C  */
   __IO uint32_t RESERVED5[40];     
   __IO uint32_t MMCCR;            /*!< ETH MMCCR Register,                 Address offset: 0x0100  */
   __IO uint32_t MMCRIR;           /*!< ETH MMCRIR Register,                Address offset: 0x0104  */
   __IO uint32_t MMCTIR;           /*!< ETH MMCTIR Register,                Address offset: 0x0108  */
   __IO uint32_t MMCRIMR;          /*!< ETH MMCRIMR Register,               Address offset: 0x010C  */
   __IO uint32_t MMCTIMR;          /*!< ETH MMCTIMR Register,               Address offset: 0x0110  */
   __IO uint32_t RESERVED6[14];     
   __IO uint32_t MMCTGFSCCR;       /*!< ETH MMCTGFSCCR Register,            Address offset: 0x014C  */
   __IO uint32_t MMCTGFMSCCR;      /*!< ETH MMCTGFMSCCR Register,           Address offset: 0x0150  */
   __IO uint32_t RESERVED7[5];      
   __IO uint32_t MMCTGFCR;         /*!< ETH MMCTGFCR Register,              Address offset: 0x0168  */
   __IO uint32_t RESERVED8[10];     
   __IO uint32_t MMCRFCECR;        /*!< ETH MMCRFCECR Register,             Address offset: 0x0194  */
   __IO uint32_t MMCRFAECR;        /*!< ETH MMCRFAECR Register,             Address offset: 0x0198  */
   __IO uint32_t RESERVED9[10];     
   __IO uint32_t MMCRGUFCR;        /*!< ETH MMCRGUFCR Register,             Address offset: 0x01C4  */
   __IO uint32_t RESERVED10[334];   
   __IO uint32_t PTPTSCR;          /*!< ETH PTPTSCR Register,               Address offset: 0x0700  */
   __IO uint32_t PTPSSIR;          /*!< ETH PTPSSIR Register,               Address offset: 0x0704  */
   __IO uint32_t PTPTSHR;          /*!< ETH PTPTSHR Register,               Address offset: 0x0708  */
   __IO uint32_t PTPTSLR;          /*!< ETH PTPTSLR Register,               Address offset: 0x070C  */
   __IO uint32_t PTPTSHUR;         /*!< ETH PTPTSHUR Register,              Address offset: 0x0710  */
   __IO uint32_t PTPTSLUR;         /*!< ETH PTPTSLUR Register,              Address offset: 0x0714  */
   __IO uint32_t PTPTSAR;          /*!< ETH PTPTSAR Register,               Address offset: 0x0718  */
   __IO uint32_t PTPTTHR;          /*!< ETH PTPTTHR Register,               Address offset: 0x071C  */
   __IO uint32_t PTPTTLR;          /*!< ETH PTPTTLR Register,               Address offset: 0x0720  */
   __IO uint32_t RESERVED11[567];   
   __IO uint32_t DMABMR;           /*!< ETH DMABMR Register,                Address offset: 0x1000  */
   __IO uint32_t DMATPDR;          /*!< ETH DMATPDR Register,               Address offset: 0x1004  */
   __IO uint32_t DMARPDR;          /*!< ETH DMARPDR Register,               Address offset: 0x1008  */
   __IO uint32_t DMARDLAR;         /*!< ETH DMARDLAR Register,              Address offset: 0x100C  */
   __IO uint32_t DMATDLAR;         /*!< ETH DMATDLAR Register,              Address offset: 0x1010  */
   __IO uint32_t DMASR;            /*!< ETH DMASR Register,                 Address offset: 0x1014  */
   __IO uint32_t DMAOMR;           /*!< ETH DMAOMR Register,                Address offset: 0x1018  */
   __IO uint32_t DMAIER;           /*!< ETH DMAIER Register,                Address offset: 0x101C  */
   __IO uint32_t DMAMFBOCR;        /*!< ETH DMAMFBOCR Register,             Address offset: 0x1020  */
   __IO uint32_t DMARIWT;          /*!< ETH DMARIWT Register,               Address offset: 0x1024  */
   __IO uint32_t RESERVED12[8];     
   __IO uint32_t DMACHTDR;         /*!< ETH DMACHTDR Register,              Address offset: 0x1048  */
   __IO uint32_t DMACHRDR;         /*!< ETH DMACHRDR Register,              Address offset: 0x104C  */
   __IO uint32_t DMACHTBAR;        /*!< ETH DMACHTBAR Register,             Address offset: 0x1050  */
   __IO uint32_t DMACHRBAR;        /*!< ETH DMACHRBAR Register,             Address offset: 0x1054  */
} ETH_TypeDef;

/**
* @brief EXTI Registers
*/
typedef struct
{
   __IO uint32_t IMR1;             /*!< EXTI IMR1 Register,                 Address offset: 0x00  */
   __IO uint32_t EMR1;             /*!< EXTI EMR1 Register,                 Address offset: 0x04  */
   __IO uint32_t RTSR;             /*!< EXTI RTSR Register,                 Address offset: 0x08  */
   __IO uint32_t FTSR;             /*!< EXTI FTSR Register,                 Address offset: 0x0C  */
   __IO uint32_t SWIER;            /*!< EXTI SWIER Register,                Address offset: 0x10  */
   __IO uint32_t PR;               /*!< EXTI PR Register,                   Address offset: 0x14  */
   __IO uint32_t IMR2;             /*!< EXTI IMR2 Register,                 Address offset: 0x18  */
   __IO uint32_t EMR2;             /*!< EXTI EMR2 Register,                 Address offset: 0x1C  */
} EXTI_TypeDef;

/**
* @brief FMC Registers
*/
typedef struct
{
   __IO uint32_t ACR;              /*!< FLASH ACR Register,                 Address offset: 0x00  */
   __IO uint32_t RESERVED1;         
   __IO uint32_t KEYR;             /*!< FLASH KEYR Register,                Address offset: 0x08  */
   __IO uint32_t OPTKEYR;          /*!< FLASH OPTKEYR Register,             Address offset: 0x0C  */
   __IO uint32_t SR;               /*!< FLASH SR Register,                  Address offset: 0x10  */
   __IO uint32_t CR;               /*!< FLASH CR Register,                  Address offset: 0x14  */
   __IO uint32_t ECCR;             /*!< FLASH ECCR Register,                Address offset: 0x18  */
   __IO uint32_t RESERVED2;         
   __IO uint32_t OPTR1;            /*!< FLASH OPTR1 Register,               Address offset: 0x20  */
   __IO uint32_t OPTR2;            /*!< FLASH OPTR2 Register,               Address offset: 0x24  */
   __IO uint32_t RESERVED3;         
   __IO uint32_t WRPR;             /*!< FLASH WRPR Register,                Address offset: 0x2C  */
   __IO uint32_t PCROP0SR;         /*!< FLASH PCROP0SR Register,            Address offset: 0x30  */
   __IO uint32_t PCROP0ER;         /*!< FLASH PCROP0ER Register,            Address offset: 0x34  */
   __IO uint32_t PCROP1SR;         /*!< FLASH PCROP1SR Register,            Address offset: 0x38  */
   __IO uint32_t PCROP1ER;         /*!< FLASH PCROP1ER Register,            Address offset: 0x3C  */
} FLASH_TypeDef;




/**
* @brief General Purpose I/O
*/
typedef struct
{
    __IO uint32_t MODER;       /*!< GPIO port mode register,               Address offset: 0x00      */
    __IO uint32_t OTYPER;      /*!< GPIO port output type register,        Address offset: 0x04      */
    __IO uint32_t OSPEEDR;     /*!< GPIO port output speed register,       Address offset: 0x08      */
    __IO uint32_t PUPDR;       /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C      */
    __IO uint32_t IDR;         /*!< GPIO port input data register,         Address offset: 0x10      */
    __IO uint32_t ODR;         /*!< GPIO port output data register,        Address offset: 0x14      */
    __IO uint32_t BSRR;        /*!< GPIO port bit set/reset  register,     Address offset: 0x18      */
    __IO uint32_t LCKR;        /*!< GPIO port configuration lock register, Address offset: 0x1C      */
    __IO uint32_t AFR[2];      /*!< GPIO alternate function registers,     Address offset: 0x20-0x24 */
    __IO uint32_t BRR;         /*!< GPIO Bit Reset register,               Address offset: 0x28      */
} GPIO_TypeDef;

/**
* @brief I2C Registers
*/
typedef struct
{
   __IO uint32_t CR1;              /*!< I2C CR1 Register,                   Address offset: 0x00  */
   __IO uint32_t CR2;              /*!< I2C CR2 Register,                   Address offset: 0x04  */
   __IO uint32_t OAR1;             /*!< I2C OAR1 Register,                  Address offset: 0x08  */
   __IO uint32_t OAR2;             /*!< I2C OAR2 Register,                  Address offset: 0x0C  */
   __IO uint32_t DR;               /*!< I2C DR Register,                    Address offset: 0x10  */
   __IO uint32_t SR1;              /*!< I2C SR1 Register,                   Address offset: 0x14  */
   __IO uint32_t SR2;              /*!< I2C SR2 Register,                   Address offset: 0x18  */
   __IO uint32_t CCR;              /*!< I2C CCR Register,                   Address offset: 0x1C  */
   __IO uint32_t TRISE;            /*!< I2C TRISE Register,                 Address offset: 0x20  */
   __IO uint32_t TIMEOUTR;         /*!< I2C TIMEOUTR Register,              Address offset: 0x24  */
} I2C_TypeDef;
/**
* @brief IWDG Registers
*/
typedef struct
{
   __IO uint32_t KR;               /*!< IWDG KR Register,                   Address offset: 0x0  */
   __IO uint32_t PR;               /*!< IWDG PR Register,                   Address offset: 0x4  */
   __IO uint32_t RLR;              /*!< IWDG RLR Register,                  Address offset: 0x8  */
   __IO uint32_t SR;               /*!< IWDG SR Register,                   Address offset: 0xC  */
}IWDG_TypeDef;

/**
  * @brief LCDC registers
  */
typedef struct
{
  __IO uint32_t DR;          /*!< LCD desc DR;  , Address offset: 0x04 */
  __IO uint32_t CMDR;        /*!< LCD desc CMDR;, Address offset: 0x08 */
  __IO uint32_t WCFGR;       /*!< LCD desc WCFGR, Address offset: 0x0C */
  __IO uint32_t RCFGR;       /*!< LCD desc RCFGR, Address offset: 0x10 */
} LCDC_TypeDef;

typedef struct
{
  __IO uint32_t CSR;          /*!< LCDC common configuration and status register,   Address offset: 0x00 */
} LCDC_Common_TypeDef;

/**
* @brief LPTIM Registers
*/
typedef struct
{
   __IO uint32_t ISR;              /*!< LPTIM ISR Register,                 Address offset: 0x00  */
   __IO uint32_t ICR;              /*!< LPTIM ICR Register,                 Address offset: 0x04  */
   __IO uint32_t IER;              /*!< LPTIM IER Register,                 Address offset: 0x08  */
   __IO uint32_t CFGR;             /*!< LPTIM CFGR Register,                Address offset: 0x0C  */
   __IO uint32_t CR;               /*!< LPTIM CR Register,                  Address offset: 0x10  */
   __IO uint32_t CMP;              /*!< LPTIM CMP Register,                 Address offset: 0x14  */
   __IO uint32_t ARR;              /*!< LPTIM ARR Register,                 Address offset: 0x18  */
   __IO uint32_t CNT;              /*!< LPTIM CNT Register,                 Address offset: 0x1C  */
   __IO uint32_t OR;               /*!< LPTIM OR Register,                  Address offset: 0x20  */
} LPTIM_TypeDef;


/**
  * @brief Comparator
  */
typedef struct
{
  __IO uint32_t CSR;            /*!< OPA output enable register,            Address offset: 0x00 */
  __IO uint32_t RESERVED[2];    
  __IO uint32_t TCMR;           /*!< OPA control register,                  Address offset: 0x0C */
} OPA_TypeDef;

/**
* @brief PWR Registers
*/
typedef struct
{
    __IO uint32_t CR1;         /*!< PWR desc CR1, Address offset: 0x00 */
    __IO uint32_t CR2;         /*!< PWR desc CR2, Address offset: 0x04 */
    __IO uint32_t CR3;         /*!< PWR desc CR3, Address offset: 0x08 */
    __IO uint32_t CR4;         /*!< PWR desc CR4, Address offset: 0x0C */
    __IO uint32_t SR;          /*!< PWR desc SR,  Address offset: 0x10 */
    __IO uint32_t SCR;         /*!< PWR desc SCR, Address offset: 0x14 */
}PWR_TypeDef;

/**
* @brief ESMC Registers
*/
typedef struct
{
   __IO uint8_t CR;                /*!< ESMC CR Register,                   Address offset: 0x0  */
   __IO uint8_t CR2;               /*!< ESMC CR2 Register,                  Address offset: 0x1  */
   __IO uint8_t TCR;               /*!< ESMC TCR Register,                  Address offset: 0x2  */
   __IO uint8_t BAUD;              /*!< ESMC BAUD Register,                 Address offset: 0x3  */
   __IO uint8_t SFCR;              /*!< ESMC SFCR Register,                 Address offset: 0x4  */
   __IO uint8_t SOCR;              /*!< ESMC SOCR Register,                 Address offset: 0x5  */
   __IO uint8_t DCR;               /*!< ESMC DCR Register,                  Address offset: 0x6  */
   __IO uint8_t CR3;               /*!< ESMC CR3 Register,                  Address offset: 0x7  */
   __IO uint32_t ADDR24;           /*!< ESMC ADDR24 Register,               Address offset: 0x8  */
   __IO uint32_t ADDR32;           /*!< ESMC ADDR32 Register,               Address offset: 0xC  */
   __IO uint32_t DATA;             /*!< ESMC DATA Register,                 Address offset: 0x10  */
   __IO uint8_t SR;                /*!< ESMC SR Register,                   Address offset: 0x14  */
   __IO uint8_t SR1;               /*!< ESMC SR1 Register,                  Address offset: 0x15  */
   __IO uint8_t RXSTAT;            /*!< ESMC RXSTAT Register,               Address offset: 0x16  */
   __IO uint8_t RESERVED1;          
   __IO uint8_t IFR1;              /*!< ESMC IFR1 Register,                 Address offset: 0x18  */
   __IO uint8_t IER1;              /*!< ESMC IER1 Register,                 Address offset: 0x19  */
   __IO uint8_t IFR2;              /*!< ESMC IFR2 Register,                 Address offset: 0x1A  */
   __IO uint8_t IER2;              /*!< ESMC IER2 Register,                 Address offset: 0x1B  */
   __IO uint8_t STRR;              /*!< ESMC STRR Register,                 Address offset: 0x1C  */
   __IO uint8_t RESERVED2[3];       
   __IO uint8_t XSFCR;             /*!< ESMC XSFCR Register,                Address offset: 0x20  */
   __IO uint8_t XSOCR;             /*!< ESMC XSOCR Register,                Address offset: 0x21  */
   __IO uint8_t XDCR;              /*!< ESMC XDCR Register,                 Address offset: 0x22  */
   __IO uint8_t XCR3;              /*!< ESMC XCR3 Register,                 Address offset: 0x23  */
   __IO uint8_t XMODE;             /*!< ESMC XMODE Register,                Address offset: 0x24  */
   __IO uint8_t XMODE_WE;          /*!< ESMC XMODE_WE Register,             Address offset: 0x25  */
   __IO uint8_t XSSOCR;            /*!< ESMC XSSOCR Register,               Address offset: 0x26  */
   __IO uint8_t XSSOCR_WE;         /*!< ESMC XSSOCR_WE Register,            Address offset: 0x27  */
   __IO uint8_t XSFCR_WE;          /*!< ESMC XSFCR_WE Register,             Address offset: 0x28  */
   __IO uint8_t XSOCR_WE;          /*!< ESMC XSOCR_WE Register,             Address offset: 0x29  */
   __IO uint8_t XDCR_WE;           /*!< ESMC XDCR_WE Register,              Address offset: 0x2A  */
   __IO uint8_t XCR3_WE;           /*!< ESMC XCR3_WE Register,              Address offset: 0x2B  */
   __IO uint32_t BCR;              /*!< ESMC BCR Register,                  Address offset: 0x2C  */
   __IO uint8_t RXTOUT;            /*!< ESMC RXTOUT Register,               Address offset: 0x30  */
   __IO uint8_t XSTRR;             /*!< ESMC XSTRR Register,                Address offset: 0x31  */
} ESMC_TypeDef;

/**
* @brief RCC Registers
*/
typedef struct
{
   __IO uint32_t CR;               /*!< RCC CR Register,                    Address offset: 0x00  */
   __IO uint32_t CFGR;             /*!< RCC CFGR Register,                  Address offset: 0x04  */
   __IO uint32_t CIR;              /*!< RCC CIR Register,                   Address offset: 0x08  */
   __IO uint32_t RESERVED1[7];      
   __IO uint32_t AHB1RSTR;         /*!< RCC AHB1RSTR Register,              Address offset: 0x28  */
   __IO uint32_t AHB2RSTR;         /*!< RCC AHB2RSTR Register,              Address offset: 0x2C  */
   __IO uint32_t RESERVED2[2];      
   __IO uint32_t APB1RSTR1;        /*!< RCC APB1RSTR1 Register,             Address offset: 0x38  */
   __IO uint32_t APB1RSTR2;        /*!< RCC APB1RSTR2 Register,             Address offset: 0x3C  */
   __IO uint32_t APB2RSTR;         /*!< RCC APB2RSTR Register,              Address offset: 0x40  */
   __IO uint32_t RESERVED3;         
   __IO uint32_t AHB1ENR;          /*!< RCC AHB1ENR Register,               Address offset: 0x48  */
   __IO uint32_t AHB2ENR;          /*!< RCC AHB2ENR Register,               Address offset: 0x4C  */
   __IO uint32_t RESERVED4[2];      
   __IO uint32_t APB1ENR1;         /*!< RCC APB1ENR1 Register,              Address offset: 0x58  */
   __IO uint32_t APB1ENR2;         /*!< RCC APB1ENR2 Register,              Address offset: 0x5C  */
   __IO uint32_t APB2ENR;          /*!< RCC APB2ENR Register,               Address offset: 0x60  */
   __IO uint32_t RESERVED5;         
   __IO uint32_t CCIPR;            /*!< RCC CCIPR Register,                 Address offset: 0x68  */
   __IO uint32_t RESERVED6;         
   __IO uint32_t BDCR;             /*!< RCC BDCR Register,                  Address offset: 0x70  */
   __IO uint32_t CSR;              /*!< RCC CSR Register,                   Address offset: 0x74  */
   __IO uint32_t CFGR1;            /*!< RCC CFGR1 Register,                 Address offset: 0x78  */
   __IO uint32_t CFGR2;            /*!< RCC CFGR2 Register,                 Address offset: 0x7C  */
   __IO uint32_t CFGR3;            /*!< RCC CFGR3 Register,                 Address offset: 0x80  */
} RCC_TypeDef;


/**
* @brief RNG Registers
*/
typedef struct
{
   __IO uint32_t CR;               /*!< RNG CR Register,                    Address offset: 0x00  */
   __IO uint32_t LFSR;             /*!< RNG LFSR Register,                  Address offset: 0x04  */
   __IO uint32_t SR;               /*!< RNG SR Register,                    Address offset: 0x08  */
   __IO uint32_t DR;               /*!< RNG DR Register,                    Address offset: 0x0C  */
} RNG_TypeDef;

/**
* @brief RTC Registers
*/
typedef struct
{
   __IO uint32_t CRH;              /*!< RTC CRH Register,                   Address offset: 0x00  */
   __IO uint32_t CRL;              /*!< RTC CRL Register,                   Address offset: 0x04  */
   __IO uint32_t PRLH;             /*!< RTC PRLH Register,                  Address offset: 0x08  */
   __IO uint32_t PRLL;             /*!< RTC PRLL Register,                  Address offset: 0x0C  */
   __IO uint32_t DIVH;             /*!< RTC DIVH Register,                  Address offset: 0x10  */
   __IO uint32_t DIVL;             /*!< RTC DIVL Register,                  Address offset: 0x14  */
   __IO uint32_t CNTH;             /*!< RTC CNTH Register,                  Address offset: 0x18  */
   __IO uint32_t CNTL;             /*!< RTC CNTL Register,                  Address offset: 0x1C  */
   __IO uint32_t ALRH;             /*!< RTC ALRH Register,                  Address offset: 0x20  */
   __IO uint32_t ALRL;             /*!< RTC ALRL Register,                  Address offset: 0x24  */
} RTC_TypeDef;


/**
* @brief SDIO Registers
*/
typedef struct
{
    __IO uint32_t POWER;       /*!< SDIO desc POWER,    Address offset: 0x00 */
    __IO uint32_t CLKCR;       /*!< SDIO desc CLKCR,    Address offset: 0x04 */
    __IO uint32_t ARG;         /*!< SDIO desc ARG,      Address offset: 0x08 */
    __IO uint32_t CMD;         /*!< SDIO desc CMD,      Address offset: 0x0C */
    __IO uint32_t RESPCMD;     /*!< SDIO desc RESPCMD,  Address offset: 0x10 */
    __IO uint32_t RESP0;       /*!< SDIO desc RESP0,    Address offset: 0x14 */
    __IO uint32_t RESP1;       /*!< SDIO desc RESP1,    Address offset: 0x18 */
    __IO uint32_t RESP2;       /*!< SDIO desc RESP2,    Address offset: 0x1C */
    __IO uint32_t RESP3;       /*!< SDIO desc RESP3,    Address offset: 0x20 */
    __IO uint32_t TMOUT;       /*!< SDIO desc TMOUT,    Address offset: 0x24 */
    __IO uint32_t BLKSIZ;      /*!< SDIO desc BLKSIZ,   Address offset: 0x28 */
    __IO uint32_t DLEN;        /*!< SDIO desc DLEN,     Address offset: 0x2C */
    __IO uint32_t CTRL;        /*!< SDIO desc CTRL,     Address offset: 0x30 */
    __IO uint32_t STATUS;      /*!< SDIO desc STATUS,   Address offset: 0x34 */
    __IO uint32_t INTSTS;      /*!< SDIO desc INTSTS,   Address offset: 0x38 */
    __IO uint32_t INTMASK;     /*!< SDIO desc INTMASK,  Address offset: 0x3C */
    __IO uint32_t FIFOTH;      /*!< SDIO desc FIFOTH,   Address offset: 0x40 */
    __IO uint32_t TCBCNT;      /*!< SDIO desc TCBCNT,   Address offset: 0x44 */
    __IO uint32_t TBBCNT;      /*!< SDIO desc TBBCNT,   Address offset: 0x48 */
    uint8_t RESERVED19[436];   /*!< Reserved, Address offset: 0x4C - 0x1FF */
    __IO uint32_t FIFODATA;    /*!< SDIO desc FIFODATA, Address offset: 0x200 */
}SDIO_TypeDef;

/**
* @brief SPI Registers
*/
typedef struct
{
   __IO uint32_t CR1;              /*!< SPI CR1 Register,                   Address offset: 0x00  */
   __IO uint32_t CR2;              /*!< SPI CR2 Register,                   Address offset: 0x04  */
   __IO uint32_t SR;               /*!< SPI SR Register,                    Address offset: 0x08  */
   __IO uint32_t DR;               /*!< SPI DR Register,                    Address offset: 0x0C  */
   __IO uint32_t CRCPR;            /*!< SPI CRCPR Register,                 Address offset: 0x10  */
   __IO uint32_t RXCRCR;           /*!< SPI RXCRCR Register,                Address offset: 0x14  */
   __IO uint32_t TXCRCR;           /*!< SPI TXCRCR Register,                Address offset: 0x18  */
   __IO uint32_t I2SCFGR;          /*!< SPI I2SCFGR Register,               Address offset: 0x1C  */
   __IO uint32_t I2SPR;            /*!< SPI I2SPR Register,                 Address offset: 0x20  */
} SPI_TypeDef;




