Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xC.h
/********************************* Bit definition for AES_INGF_STATUS register **********************************/
#define AES_INGF_STATUS_ING_EMPTY_Pos             (0U)
#define AES_INGF_STATUS_ING_EMPTY_Msk             (0x1UL<<AES_INGF_STATUS_ING_EMPTY_Pos)            /*!< 0x00000001 */
#define AES_INGF_STATUS_ING_EMPTY                 AES_INGF_STATUS_ING_EMPTY_Msk                     
#define AES_INGF_STATUS_ING_FULL_Pos              (1U)
#define AES_INGF_STATUS_ING_FULL_Msk              (0x1UL<<AES_INGF_STATUS_ING_FULL_Pos)             /*!< 0x00000002 */
#define AES_INGF_STATUS_ING_FULL                  AES_INGF_STATUS_ING_FULL_Msk                      

/********************************* Bit definition for AES_ENGRESS_FIFO register *************************************/
#define AES_ENGRESS_FIFO_INGRESS_FIFO_Pos         (0U)
#define AES_ENGRESS_FIFO_INGRESS_FIFO_Msk         (0xFFFFFFFFUL<<AES_ENGRESS_FIFO_INGRESS_FIFO_Pos) /*!< 0xFFFFFFFF */
#define AES_ENGRESS_FIFO_INGRESS_FIFO             AES_ENGRESS_FIFO_INGRESS_FIFO_Msk

/********************************* Bit definition for AES_ENGFIFO_STATUS register ***********************************/
#define AES_ENGFIFO_STATUS_ENG_EMPTY_Pos          (0U)
#define AES_ENGFIFO_STATUS_ENG_EMPTY_Msk          (0x1UL<<AES_ENGFIFO_STATUS_ENG_EMPTY_Pos)         /*!< 0x00000001 */
#define AES_ENGFIFO_STATUS_ENG_EMPTY              AES_ENGFIFO_STATUS_ENG_EMPTY_Msk                  
#define AES_ENGFIFO_STATUS_ENG_FULL_Pos           (1U)
#define AES_ENGFIFO_STATUS_ENG_FULL_Msk           (0x1UL<<AES_ENGFIFO_STATUS_ENG_FULL_Pos)          /*!< 0x00000002 */
#define AES_ENGFIFO_STATUS_ENG_FULL               AES_ENGFIFO_STATUS_ENG_FULL_Msk                   

/********************************* Bit definition for AES_ING_DMA_DONE register *************************************/
#define AES_ING_DMA_DONE_DMA_INGRESS_DONE_Pos     (0U)
#define AES_ING_DMA_DONE_DMA_INGRESS_DONE_Msk     (0x1UL<<AES_ING_DMA_DONE_DMA_INGRESS_DONE_Pos)    /*!< 0x00000001 */
#define AES_ING_DMA_DONE_DMA_INGRESS_DONE         AES_ING_DMA_DONE_DMA_INGRESS_DONE_Msk             

/********************************* Bit definition for AES_ENG_DMA_DONE register *************************************/
#define AES_ENG_DMA_DONE_DMA_NGRESS_DONE_Pos      (0U)
#define AES_ENG_DMA_DONE_DMA_NGRESS_DONE_Msk      (0x1UL<<AES_ENG_DMA_DONE_DMA_NGRESS_DONE_Pos)     /*!< 0x00000001 */
#define AES_ENG_DMA_DONE_DMA_NGRESS_DONE          AES_ENG_DMA_DONE_DMA_NGRESS_DONE_Msk              

/********************************* Bit definition for AES_DONE_STATUS register **************************************/
#define AES_DONE_STATUS_AES_DONE_Pos              (0U)
#define AES_DONE_STATUS_AES_DONE_Msk              (0x1UL<<AES_DONE_STATUS_AES_DONE_Pos)             /*!< 0x00000001 */
#define AES_DONE_STATUS_AES_DONE                  AES_DONE_STATUS_AES_DONE_Msk                      
#define AES_DONE_STATUS_MAC_VAILD_Pos             (1U)
#define AES_DONE_STATUS_MAC_VAILD_Msk             (0x1UL<<AES_DONE_STATUS_MAC_VAILD_Pos)            /*!< 0x00000002 */
#define AES_DONE_STATUS_MAC_VAILD                 AES_DONE_STATUS_MAC_VAILD_Msk                     

/********************************************************************************************************************/
/********************************* BKP ******************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for BKP_CR register ***********************************************/
#define BKP_CR_TPE_Pos                            (0U)
#define BKP_CR_TPE_Msk                            (0x1UL<<BKP_CR_TPE_Pos)                           /*!< 0x00000001 */
#define BKP_CR_TPE                                BKP_CR_TPE_Msk                                    /*!< TAMP enable */
#define BKP_CR_TPAL_Pos                           (1U)
#define BKP_CR_TPAL_Msk                           (0x1UL<<BKP_CR_TPAL_Pos)                          /*!< 0x00000002 */
#define BKP_CR_TPAL                               BKP_CR_TPAL_Msk                                   /*!< TAMPER pin interrupt enable */

/********************************* Bit definition for BKP_CSR register **********************************************/
#define BKP_CSR_CTE_Pos                           (0U)
#define BKP_CSR_CTE_Msk                           (0x1UL<<BKP_CSR_CTE_Pos)                          /*!< 0x00000001 */
#define BKP_CSR_CTE                               BKP_CSR_CTE_Msk                                   /*!< clear TAMP event */
#define BKP_CSR_CTI_Pos                           (1U)
#define BKP_CSR_CTI_Msk                           (0x1UL<<BKP_CSR_CTI_Pos)                          /*!< 0x00000002 */
#define BKP_CSR_CTI                               BKP_CSR_CTI_Msk                                   /*!< clear TAMP interrupt */
#define BKP_CSR_TPIE_Pos                          (2U)
#define BKP_CSR_TPIE_Msk                          (0x1UL<<BKP_CSR_TPIE_Pos)                         /*!< 0x00000004 */
#define BKP_CSR_TPIE                              BKP_CSR_TPIE_Msk                                  /*!< TAMP interrupt enable */
#define BKP_CSR_TEF_Pos                           (8U)
#define BKP_CSR_TEF_Msk                           (0x1UL<<BKP_CSR_TEF_Pos)                          /*!< 0x00000100 */
#define BKP_CSR_TEF                               BKP_CSR_TEF_Msk                                   /*!< TAMP event flag */
#define BKP_CSR_TIF_Pos                           (9U)
#define BKP_CSR_TIF_Msk                           (0x1UL<<BKP_CSR_TIF_Pos)                          /*!< 0x00000200 */
#define BKP_CSR_TIF                               BKP_CSR_TIF_Msk                                   /*!< TAMP interrupt flag */

/********************************* Bit definition for BKP_RTCCR register ********************************************/
#define BKP_RTCCR_CAL_Pos                         (0U)
#define BKP_RTCCR_CAL_Msk                         (0x7FUL<<BKP_RTCCR_CAL_Pos)                       /*!< 0x0000007F */
#define BKP_RTCCR_CAL                             BKP_RTCCR_CAL_Msk                                 /*!< RTC calibration value */
#define BKP_RTCCR_CAL_0                           (0x1UL << BKP_RTCCR_CAL_Pos)                      /*!< 0x00000001 */
#define BKP_RTCCR_CAL_1                           (0x2UL << BKP_RTCCR_CAL_Pos)                      /*!< 0x00000002 */
#define BKP_RTCCR_CAL_2                           (0x4UL << BKP_RTCCR_CAL_Pos)                      /*!< 0x00000004 */
#define BKP_RTCCR_CAL_3                           (0x8UL << BKP_RTCCR_CAL_Pos)                      /*!< 0x00000008 */
#define BKP_RTCCR_CAL_4                           (0x10UL << BKP_RTCCR_CAL_Pos)                     /*!< 0x00000010 */
#define BKP_RTCCR_CAL_5                           (0x20UL << BKP_RTCCR_CAL_Pos)                     /*!< 0x00000020 */
#define BKP_RTCCR_CAL_6                           (0x40UL << BKP_RTCCR_CAL_Pos)                     /*!< 0x00000040 */

