Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xC.h
/********************************* Bit definition for BKP_DR20 register *********************************************/
#define BKP_DR20_D_Pos                            (0U)
#define BKP_DR20_D_Msk                            (0xFFFFFFFFUL<<BKP_DR20_D_Pos)                    /*!< 0xFFFFFFFF */
#define BKP_DR20_D                                BKP_DR20_D_Msk                                    /*!< bakeup data word20 */

/********************************* Bit definition for BKP_DR21 register *********************************************/
#define BKP_DR21_D_Pos                            (0U)
#define BKP_DR21_D_Msk                            (0xFFFFFFFFUL<<BKP_DR21_D_Pos)                    /*!< 0xFFFFFFFF */
#define BKP_DR21_D                                BKP_DR21_D_Msk                                    /*!< bakeup data word21 */

/********************************* Bit definition for BKP_DR22 register *********************************************/
#define BKP_DR22_D_Pos                            (0U)
#define BKP_DR22_D_Msk                            (0xFFFFFFFFUL<<BKP_DR22_D_Pos)                    /*!< 0xFFFFFFFF */
#define BKP_DR22_D                                BKP_DR22_D_Msk                                    /*!< bakeup data word22 */

/********************************* Bit definition for BKP_DR23 register *********************************************/
#define BKP_DR23_D_Pos                            (0U)
#define BKP_DR23_D_Msk                            (0xFFFFFFFFUL<<BKP_DR23_D_Pos)                    /*!< 0xFFFFFFFF */
#define BKP_DR23_D                                BKP_DR23_D_Msk                                    /*!< bakeup data word23 */

/********************************* Bit definition for BKP_DR24 register *********************************************/
#define BKP_DR24_D_Pos                            (0U)
#define BKP_DR24_D_Msk                            (0xFFFFFFFFUL<<BKP_DR24_D_Pos)                    /*!< 0xFFFFFFFF */
#define BKP_DR24_D                                BKP_DR24_D_Msk                                    /*!< bakeup data word24 */

/********************************* Bit definition for BKP_DR25 register *********************************************/
#define BKP_DR25_D_Pos                            (0U)
#define BKP_DR25_D_Msk                            (0xFFFFFFFFUL<<BKP_DR25_D_Pos)                    /*!< 0xFFFFFFFF */
#define BKP_DR25_D                                BKP_DR25_D_Msk                                    /*!< bakeup data word25 */

/********************************* Bit definition for BKP_DR26 register *********************************************/
#define BKP_DR26_D_Pos                            (0U)
#define BKP_DR26_D_Msk                            (0xFFFFFFFFUL<<BKP_DR26_D_Pos)                    /*!< 0xFFFFFFFF */
#define BKP_DR26_D                                BKP_DR26_D_Msk                                    /*!< bakeup data word26 */

/********************************* Bit definition for BKP_DR27 register *********************************************/
#define BKP_DR27_D_Pos                            (0U)
#define BKP_DR27_D_Msk                            (0xFFFFFFFFUL<<BKP_DR27_D_Pos)                    /*!< 0xFFFFFFFF */
#define BKP_DR27_D                                BKP_DR27_D_Msk                                    /*!< bakeup data word27 */

/********************************* Bit definition for BKP_DR28 register *********************************************/
#define BKP_DR28_D_Pos                            (0U)
#define BKP_DR28_D_Msk                            (0xFFFFFFFFUL<<BKP_DR28_D_Pos)                    /*!< 0xFFFFFFFF */
#define BKP_DR28_D                                BKP_DR28_D_Msk                                    /*!< bakeup data word28 */

/********************************* Bit definition for BKP_DR29 register *********************************************/
#define BKP_DR29_D_Pos                            (0U)
#define BKP_DR29_D_Msk                            (0xFFFFFFFFUL<<BKP_DR29_D_Pos)                    /*!< 0xFFFFFFFF */
#define BKP_DR29_D                                BKP_DR29_D_Msk                                    /*!< bakeup data word29 */

/********************************* Bit definition for BKP_DR30 register *********************************************/
#define BKP_DR30_D_Pos                            (0U)
#define BKP_DR30_D_Msk                            (0xFFFFFFFFUL<<BKP_DR30_D_Pos)                    /*!< 0xFFFFFFFF */
#define BKP_DR30_D                                BKP_DR30_D_Msk                                    /*!< bakeup data word30 */

/********************************* Bit definition for BKP_DR31 register *********************************************/
#define BKP_DR31_D_Pos                            (0U)
#define BKP_DR31_D_Msk                            (0xFFFFFFFFUL<<BKP_DR31_D_Pos)                    /*!< 0xFFFFFFFF */
#define BKP_DR31_D                                BKP_DR31_D_Msk                                    /*!< bakeup data word31 */

#define RTC_BKP_NUMBER 31

/****************************************************************************/
/*                                                                          */
/*                      Analog Comparators (COMP)                           */
/*                                                                          */
/****************************************************************************/
/**********************  Bit definition for COMP_CSR register  **************/
#define COMP_CSR_EN_Pos            (0U)
#define COMP_CSR_EN_Msk            (0x1UL << COMP_CSR_EN_Pos)                  /*!< 0x00000001 */
#define COMP_CSR_EN                COMP_CSR_EN_Msk                             /*!< Comparator enable */
#define COMP_CSR_COMP1_EN          COMP_CSR_EN
#define COMP_CSR_COMP2_EN          COMP_CSR_EN
#define COMP_CSR_COMP3_EN          COMP_CSR_EN
#define COMP_CSR_COMP4_EN          COMP_CSR_EN

#define COMP_CSR_VSEL_Pos          (1U)
#define COMP_CSR_VSEL_Msk          (0x3UL << COMP_CSR_VSEL_Pos)                /*!< 0x00000006 */
#define COMP_CSR_VSEL              COMP_CSR_VSEL_Msk                           /*!< VREFCMP DIV SOURCE voltage select */
#define COMP_CSR_VSEL_0            (0x1UL << COMP_CSR_VSEL_Pos)                /*!< 0x00000002 */
#define COMP_CSR_VSEL_1            (0x2UL << COMP_CSR_VSEL_Pos)                /*!< 0x00000004 */

