Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xC.h
#define DBGMCU_CR2_DBG_CAN2_STOP_Pos               (2U)
#define DBGMCU_CR2_DBG_CAN2_STOP_Msk               (0x1UL << DBGMCU_CR2_DBG_CAN2_STOP_Pos)            /*!< 0x00000004 */
#define DBGMCU_CR2_DBG_CAN2_STOP                   DBGMCU_CR2_DBG_CAN2_STOP_Msk                       /*!< desc DBG_CAN2_STOP */

#define DBGMCU_CR2_DBG_TIM15_STOP_Pos              (3U)
#define DBGMCU_CR2_DBG_TIM15_STOP_Msk              (0x1UL << DBGMCU_CR2_DBG_TIM15_STOP_Pos)           /*!< 0x00000008 */
#define DBGMCU_CR2_DBG_TIM15_STOP                  DBGMCU_CR2_DBG_TIM15_STOP_Msk                      /*!< desc DBG_TIM15_STOP */

#define DBGMCU_CR2_DBG_TIM16_STOP_Pos              (4U)
#define DBGMCU_CR2_DBG_TIM16_STOP_Msk              (0x1UL << DBGMCU_CR2_DBG_TIM16_STOP_Pos)           /*!< 0x00000010 */
#define DBGMCU_CR2_DBG_TIM16_STOP                  DBGMCU_CR2_DBG_TIM16_STOP_Msk                      /*!< desc DBG_TIM16_STOP */

#define DBGMCU_CR2_DBG_TIM17_STOP_Pos              (5U)
#define DBGMCU_CR2_DBG_TIM17_STOP_Msk              (0x1UL << DBGMCU_CR2_DBG_TIM17_STOP_Pos)           /*!< 0x00000020 */
#define DBGMCU_CR2_DBG_TIM17_STOP                  DBGMCU_CR2_DBG_TIM17_STOP_Msk                      /*!< desc DBG_TIM17_STOP */

#define DBGMCU_CR2_DBG_TIM18_STOP_Pos              (6U)
#define DBGMCU_CR2_DBG_TIM18_STOP_Msk              (0x1UL << DBGMCU_CR2_DBG_TIM18_STOP_Pos)           /*!< 0x00000040 */
#define DBGMCU_CR2_DBG_TIM18_STOP                  DBGMCU_CR2_DBG_TIM18_STOP_Msk                      /*!< desc DBG_TIM18_STOP */

#define DBGMCU_CR2_DBG_TIM19_STOP_Pos              (7U)
#define DBGMCU_CR2_DBG_TIM19_STOP_Msk              (0x1UL << DBGMCU_CR2_DBG_TIM19_STOP_Pos)           /*!< 0x00000080 */
#define DBGMCU_CR2_DBG_TIM19_STOP                  DBGMCU_CR2_DBG_TIM19_STOP_Msk                      /*!< desc DBG_TIM19_STOP */

#define DBGMCU_CR2_DBG_LPTIM_STOP_Pos              (8U)
#define DBGMCU_CR2_DBG_LPTIM_STOP_Msk              (0x1UL << DBGMCU_CR2_DBG_LPTIM_STOP_Pos)           /*!< 0x00000100 */
#define DBGMCU_CR2_DBG_LPTIM_STOP                  DBGMCU_CR2_DBG_LPTIM_STOP_Msk                      /*!< desc DBG_LPTIM_STOP */

/********************************************************************************************************************/
/********************************* DMA *************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for DMA_EN register ***********************************************/
#define DMA_EN_DMA_EN_Pos                         (0U)
#define DMA_EN_DMA_EN_Msk                         (0x1UL<<DMA_EN_DMA_EN_Pos)                        /*!< 0x00000001 */
#define DMA_EN_DMA_EN                             DMA_EN_DMA_EN_Msk                                 /*!< DMA Enable bit */

/********************************* Bit definition for DMA_CH_EN register ********************************************/
#define DMA_CH_EN_CH_EN_Pos                       (0U)
#define DMA_CH_EN_CH_EN_Msk                       (0x3FUL<<DMA_CH_EN_CH_EN_Pos)                     /*!< 0x0000003F */
#define DMA_CH_EN_CH_EN                           DMA_CH_EN_CH_EN_Msk                               /*!< Channel enable */
#define DMA_CH_EN_CH_EN_0                         (0x1UL<<DMA_CH_EN_CH_EN_Pos)                      /*!< 0x00000001 */
#define DMA_CH_EN_CH_EN_1                         (0x2UL<<DMA_CH_EN_CH_EN_Pos)                      /*!< 0x00000002 */
#define DMA_CH_EN_CH_EN_2                         (0x4UL<<DMA_CH_EN_CH_EN_Pos)                      /*!< 0x00000004 */
#define DMA_CH_EN_CH_EN_3                         (0x8UL<<DMA_CH_EN_CH_EN_Pos)                      /*!< 0x00000008 */
#define DMA_CH_EN_CH_EN_4                         (0x10UL<<DMA_CH_EN_CH_EN_Pos)                     /*!< 0x00000010 */
#define DMA_CH_EN_CH_EN_5                         (0x20UL<<DMA_CH_EN_CH_EN_Pos)                     /*!< 0x00000020 */
#define DMA_CH_EN_CH_EN_WE_Pos                    (8U)
#define DMA_CH_EN_CH_EN_WE_Msk                    (0x3FUL<<DMA_CH_EN_CH_EN_WE_Pos)                  /*!< 0x00003F00 */
#define DMA_CH_EN_CH_EN_WE                        DMA_CH_EN_CH_EN_WE_Msk                            /*!< Channel enable register */
#define DMA_CH_EN_CH_EN_WE_0                      (0x1UL<<DMA_CH_EN_CH_EN_WE_Pos)                   /*!< 0x00000100 */
#define DMA_CH_EN_CH_EN_WE_1                      (0x2UL<<DMA_CH_EN_CH_EN_WE_Pos)                   /*!< 0x00000200 */
#define DMA_CH_EN_CH_EN_WE_2                      (0x4UL<<DMA_CH_EN_CH_EN_WE_Pos)                   /*!< 0x00000400 */
#define DMA_CH_EN_CH_EN_WE_3                      (0x8UL<<DMA_CH_EN_CH_EN_WE_Pos)                   /*!< 0x00000800 */
#define DMA_CH_EN_CH_EN_WE_4                      (0x10UL<<DMA_CH_EN_CH_EN_WE_Pos)                  /*!< 0x00001000 */
#define DMA_CH_EN_CH_EN_WE_5                      (0x20UL<<DMA_CH_EN_CH_EN_WE_Pos)                  /*!< 0x00002000 */

/********************************* Bit definition for DMA_CH_CTRLL register ****************************************/
#define DMA_CH_CTRLL_INT_EN_Pos                  (0U)
#define DMA_CH_CTRLL_INT_EN_Msk                  (0x1UL<<DMA_CH_CTRLL_INT_EN_Pos)                 /*!< 0x00000001 */
#define DMA_CH_CTRLL_INT_EN                      DMA_CH_CTRLL_INT_EN_Msk                          /*!< Interrupt Enable Bit */
#define DMA_CH_CTRLL_DST_TR_WIDTH_Pos            (1U)
#define DMA_CH_CTRLL_DST_TR_WIDTH_Msk            (0x7UL<<DMA_CH_CTRLL_DST_TR_WIDTH_Pos)           /*!< 0x0000000E */
#define DMA_CH_CTRLL_DST_TR_WIDTH                DMA_CH_CTRLL_DST_TR_WIDTH_Msk                    /*!< Destination Transfer Width */
#define DMA_CH_CTRLL_DST_TR_WIDTH_0              (0x1UL<<DMA_CH_CTRLL_DST_TR_WIDTH_Pos)           /*!< 0x00000002 */
#define DMA_CH_CTRLL_DST_TR_WIDTH_1              (0x2UL<<DMA_CH_CTRLL_DST_TR_WIDTH_Pos)           /*!< 0x00000004 */
#define DMA_CH_CTRLL_DST_TR_WIDTH_2              (0x4UL<<DMA_CH_CTRLL_DST_TR_WIDTH_Pos)           /*!< 0x00000008 */
#define DMA_CH_CTRLL_SRC_TR_WIDTH_Pos            (4U)
#define DMA_CH_CTRLL_SRC_TR_WIDTH_Msk            (0x7UL<<DMA_CH_CTRLL_SRC_TR_WIDTH_Pos)           /*!< 0x00000070 */
#define DMA_CH_CTRLL_SRC_TR_WIDTH                DMA_CH_CTRLL_SRC_TR_WIDTH_Msk                    /*!< Source Transfer Width */
#define DMA_CH_CTRLL_SRC_TR_WIDTH_0              (0x1UL<<DMA_CH_CTRLL_SRC_TR_WIDTH_Pos)           /*!< 0x00000010 */
#define DMA_CH_CTRLL_SRC_TR_WIDTH_1              (0x2UL<<DMA_CH_CTRLL_SRC_TR_WIDTH_Pos)           /*!< 0x00000020 */
#define DMA_CH_CTRLL_SRC_TR_WIDTH_2              (0x4UL<<DMA_CH_CTRLL_SRC_TR_WIDTH_Pos)           /*!< 0x00000040 */
#define DMA_CH_CTRLL_DINC_Pos                    (7U)
#define DMA_CH_CTRLL_DINC_Msk                    (0x3UL<<DMA_CH_CTRLL_DINC_Pos)                   /*!< 0x00000180 */
#define DMA_CH_CTRLL_DINC                        DMA_CH_CTRLL_DINC_Msk                            /*!< Destination Address Increment */
#define DMA_CH_CTRLL_DINC_0                      (0x1UL<<DMA_CH_CTRLL_DINC_Pos)                   /*!< 0x00000080 */
#define DMA_CH_CTRLL_DINC_1                      (0x2UL<<DMA_CH_CTRLL_DINC_Pos)                   /*!< 0x00000100 */
#define DMA_CH_CTRLL_SINC_Pos                    (9U)
#define DMA_CH_CTRLL_SINC_Msk                    (0x3UL<<DMA_CH_CTRLL_SINC_Pos)                   /*!< 0x00000600 */
#define DMA_CH_CTRLL_SINC                        DMA_CH_CTRLL_SINC_Msk                            /*!< Source Address Increment */
#define DMA_CH_CTRLL_SINC_0                      (0x1UL<<DMA_CH_CTRLL_SINC_Pos)                   /*!< 0x00000200 */
#define DMA_CH_CTRLL_SINC_1                      (0x2UL<<DMA_CH_CTRLL_SINC_Pos)                   /*!< 0x00000400 */
#define DMA_CH_CTRLL_DST_MSIZE_Pos               (11U)
#define DMA_CH_CTRLL_DST_MSIZE_Msk               (0x7UL<<DMA_CH_CTRLL_DST_MSIZE_Pos)              /*!< 0x00003800 */
#define DMA_CH_CTRLL_DST_MSIZE                   DMA_CH_CTRLL_DST_MSIZE_Msk                       /*!< Destination  Burst Transaction Length */
#define DMA_CH_CTRLL_DST_MSIZE_0                 (0x1UL<<DMA_CH_CTRLL_DST_MSIZE_Pos)              /*!< 0x00000800 */
#define DMA_CH_CTRLL_DST_MSIZE_1                 (0x2UL<<DMA_CH_CTRLL_DST_MSIZE_Pos)              /*!< 0x00001000 */
#define DMA_CH_CTRLL_DST_MSIZE_2                 (0x4UL<<DMA_CH_CTRLL_DST_MSIZE_Pos)              /*!< 0x00002000 */
#define DMA_CH_CTRLL_SRC_MSIZE_Pos               (14U)
#define DMA_CH_CTRLL_SRC_MSIZE_Msk               (0x7UL<<DMA_CH_CTRLL_SRC_MSIZE_Pos)              /*!< 0x0001C000 */
#define DMA_CH_CTRLL_SRC_MSIZE                   DMA_CH_CTRLL_SRC_MSIZE_Msk                       /*!< Source Burst Transaction Length */
#define DMA_CH_CTRLL_SRC_MSIZE_0                 (0x1UL<<DMA_CH_CTRLL_SRC_MSIZE_Pos)              /*!< 0x00004000 */
#define DMA_CH_CTRLL_SRC_MSIZE_1                 (0x2UL<<DMA_CH_CTRLL_SRC_MSIZE_Pos)              /*!< 0x00008000 */
#define DMA_CH_CTRLL_SRC_MSIZE_2                 (0x4UL<<DMA_CH_CTRLL_SRC_MSIZE_Pos)              /*!< 0x00010000 */
#define DMA_CH_CTRLL_TT_Pos                      (20U)
#define DMA_CH_CTRLL_TT_Msk                      (0x3UL<<DMA_CH_CTRLL_TT_Pos)                     /*!< 0x00300000 */
#define DMA_CH_CTRLL_TT                          DMA_CH_CTRLL_TT_Msk                              /*!< Transfer Type */
#define DMA_CH_CTRLL_TT_0                        (0x1UL<<DMA_CH_CTRLL_TT_Pos)                     /*!< 0x00100000 */
#define DMA_CH_CTRLL_TT_1                        (0x2UL<<DMA_CH_CTRLL_TT_Pos)                     /*!< 0x00200000 */

