Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xC.h
/********************************* Bit definition for DMA_CH_CTRLH register ****************************************/
#define DMA_CH_CTRLH_BLOCK_TS_Pos                (0U)
#define DMA_CH_CTRLH_BLOCK_TS_Msk                (0xFFFUL<<DMA_CH_CTRLH_BLOCK_TS_Pos)             /*!< 0x00000FFF */
#define DMA_CH_CTRLH_BLOCK_TS                    DMA_CH_CTRLH_BLOCK_TS_Msk                        /*!< Block Transfer Size. */

/********************************* Bit definition for DMA_CH_CFGL register *****************************************/
#define DMA_CH_CFGL_INT_SUSP_Pos                 (4U)
#define DMA_CH_CFGL_INT_SUSP_Msk                 (0x1UL<<DMA_CH_CFGL_INT_SUSP_Pos)                /*!< 0x00000010 */
#define DMA_CH_CFGL_INT_SUSP                     DMA_CH_CFGL_INT_SUSP_Msk                         /*!< Interrupt suspend */
#define DMA_CH_CFGL_CH_PRIOR_Pos                 (5U)
#define DMA_CH_CFGL_CH_PRIOR_Msk                 (0x7UL<<DMA_CH_CFGL_CH_PRIOR_Pos)                /*!< 0x000000E0 */
#define DMA_CH_CFGL_CH_PRIOR                     DMA_CH_CFGL_CH_PRIOR_Msk                         /*!< Channel Priority */
#define DMA_CH_CFGL_CH_PRIOR_0                   (0x1UL<<DMA_CH_CFGL_CH_PRIOR_Pos)                /*!< 0x00000020 */
#define DMA_CH_CFGL_CH_PRIOR_1                   (0x2UL<<DMA_CH_CFGL_CH_PRIOR_Pos)                /*!< 0x00000040 */
#define DMA_CH_CFGL_CH_PRIOR_2                   (0x4UL<<DMA_CH_CFGL_CH_PRIOR_Pos)                /*!< 0x00000080 */
#define DMA_CH_CFGL_CH_SUSP_Pos                  (8U)
#define DMA_CH_CFGL_CH_SUSP_Msk                  (0x1UL<<DMA_CH_CFGL_CH_SUSP_Pos)                 /*!< 0x00000100 */
#define DMA_CH_CFGL_CH_SUSP                      DMA_CH_CFGL_CH_SUSP_Msk                          /*!< Channel Suspend */
#define DMA_CH_CFGL_FIFO_EMPTY_Pos               (9U)
#define DMA_CH_CFGL_FIFO_EMPTY_Msk               (0x1UL<<DMA_CH_CFGL_FIFO_EMPTY_Pos)              /*!< 0x00000200 */
#define DMA_CH_CFGL_FIFO_EMPTY                   DMA_CH_CFGL_FIFO_EMPTY_Msk                       /*!< Channel FIFO status */
#define DMA_CH_CFGL_HS_SEL_DST_Pos               (10U)
#define DMA_CH_CFGL_HS_SEL_DST_Msk               (0x1UL<<DMA_CH_CFGL_HS_SEL_DST_Pos)              /*!< 0x00000400 */
#define DMA_CH_CFGL_HS_SEL_DST                   DMA_CH_CFGL_HS_SEL_DST_Msk                       /*!< Destination Software or Hardware Handshaking Select  */
#define DMA_CH_CFGL_HS_SEL_SRC_Pos               (11U)
#define DMA_CH_CFGL_HS_SEL_SRC_Msk               (0x1UL<<DMA_CH_CFGL_HS_SEL_SRC_Pos)              /*!< 0x00000800 */
#define DMA_CH_CFGL_HS_SEL_SRC                   DMA_CH_CFGL_HS_SEL_SRC_Msk                       /*!< Source Software or Hardware Handshaking Select  */
#define DMA_CH_CFGL_MAX_ABRST_Pos                (20U)
#define DMA_CH_CFGL_MAX_ABRST_Msk                (0x3FFUL<<DMA_CH_CFGL_MAX_ABRST_Pos)             /*!< 0x3FF00000 */
#define DMA_CH_CFGL_MAX_ABRST                    DMA_CH_CFGL_MAX_ABRST_Msk                        /*!< Maximum AMBA Burst Length.  */
#define DMA_CH_CFGL_RELOAD_SRC_Pos               (30U)
#define DMA_CH_CFGL_RELOAD_SRC_Msk               (0x1UL<<DMA_CH_CFGL_RELOAD_SRC_Pos)              /*!< 0x40000000 */
#define DMA_CH_CFGL_RELOAD_SRC                   DMA_CH_CFGL_RELOAD_SRC_Msk                       /*!< Automatic Source Reload */
#define DMA_CH_CFGL_RELOAD_DST_Pos               (31U)
#define DMA_CH_CFGL_RELOAD_DST_Msk               (0x1UL<<DMA_CH_CFGL_RELOAD_DST_Pos)              /*!< 0x80000000 */
#define DMA_CH_CFGL_RELOAD_DST                   DMA_CH_CFGL_RELOAD_DST_Msk                       /*!< Automatic Destination Reload */

/********************************* Bit definition for DMA_CH_CFGH register *****************************************/
#define DMA_CH_CFGH_FIFO_MODE_Pos                (1U)
#define DMA_CH_CFGH_FIFO_MODE_Msk                (0x1UL<<DMA_CH_CFGH_FIFO_MODE_Pos)               /*!< 0x00000002 */
#define DMA_CH_CFGH_FIFO_MODE                    DMA_CH_CFGH_FIFO_MODE_Msk                        /*!< FIFO Mode Select */
#define DMA_CH_CFGH_SRC_PER_Pos                  (7U)
#define DMA_CH_CFGH_SRC_PER_Msk                  (0x7UL<<DMA_CH_CFGH_SRC_PER_Pos)                 /*!< 0x00000380 */
#define DMA_CH_CFGH_SRC_PER                      DMA_CH_CFGH_SRC_PER_Msk                          /*!< Source hardware interface */
#define DMA_CH_CFGH_SRC_PER_0                    (0x1UL<<DMA_CH_CFGH_SRC_PER_Pos)                 /*!< 0x00000080 */
#define DMA_CH_CFGH_SRC_PER_1                    (0x2UL<<DMA_CH_CFGH_SRC_PER_Pos)                 /*!< 0x00000100 */
#define DMA_CH_CFGH_SRC_PER_2                    (0x4UL<<DMA_CH_CFGH_SRC_PER_Pos)                 /*!< 0x00000200 */
#define DMA_CH_CFGH_DST_PER_Pos                  (11U)
#define DMA_CH_CFGH_DST_PER_Msk                  (0x7UL<<DMA_CH_CFGH_DST_PER_Pos)                 /*!< 0x00003800 */
#define DMA_CH_CFGH_DST_PER                      DMA_CH_CFGH_DST_PER_Msk                          /*!< Destination hardware interface */
#define DMA_CH_CFGH_DST_PER_0                    (0x1UL<<DMA_CH_CFGH_DST_PER_Pos)                 /*!< 0x00000800 */
#define DMA_CH_CFGH_DST_PER_1                    (0x2UL<<DMA_CH_CFGH_DST_PER_Pos)                 /*!< 0x00001000 */
#define DMA_CH_CFGH_DST_PER_2                    (0x4UL<<DMA_CH_CFGH_DST_PER_Pos)                 /*!< 0x00002000 */

/********************************* Bit definition for DMA_SA register **********************************************/
#define DMA_SA_SA_Pos                            (0U)
#define DMA_SA_SA_Msk                            (0xFFFFFFFFUL<<DMA_SA_SA_Pos)                    /*!< 0xFFFFFFFF */
#define DMA_SA_SA                                DMA_SA_SA_Msk                                    /*!< Source Address for Channel 0 */

/********************************* Bit definition for DMA_DA register **********************************************/
#define DMA_DA_DA_Pos                            (0U)
#define DMA_DA_DA_Msk                            (0xFFFFFFFFUL<<DMA_DA_DA_Pos)                    /*!< 0xFFFFFFFF */
#define DMA_DA_DA                                DMA_DA_DA_Msk                                    /*!< Destination Address Register for Channel0 */

