Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xC.h
/********************************* Bit definition for DMA_CLEARSRCTRAN register *************************************/
#define DMA_CLEARSRCTRAN_CLEAR_Pos                (0U)
#define DMA_CLEARSRCTRAN_CLEAR_Msk                (0x3FUL<<DMA_CLEARSRCTRAN_CLEAR_Pos)              /*!< 0x0000003F */
#define DMA_CLEARSRCTRAN_CLEAR                    DMA_CLEARSRCTRAN_CLEAR_Msk                        /*!< Clear for IntSrcTran Interrupt */
#define DMA_CLEARSRCTRAN_CLEAR_0                  (0x1UL<<DMA_CLEARSRCTRAN_CLEAR_Pos)               /*!< 0x00000001 */
#define DMA_CLEARSRCTRAN_CLEAR_1                  (0x2UL<<DMA_CLEARSRCTRAN_CLEAR_Pos)               /*!< 0x00000002 */
#define DMA_CLEARSRCTRAN_CLEAR_2                  (0x4UL<<DMA_CLEARSRCTRAN_CLEAR_Pos)               /*!< 0x00000004 */
#define DMA_CLEARSRCTRAN_CLEAR_3                  (0x8UL<<DMA_CLEARSRCTRAN_CLEAR_Pos)               /*!< 0x00000008 */
#define DMA_CLEARSRCTRAN_CLEAR_4                  (0x10UL<<DMA_CLEARSRCTRAN_CLEAR_Pos)              /*!< 0x00000010 */
#define DMA_CLEARSRCTRAN_CLEAR_5                  (0x20UL<<DMA_CLEARSRCTRAN_CLEAR_Pos)              /*!< 0x00000020 */

/********************************* Bit definition for DMA_CLEARDSTTRAN register *************************************/
#define DMA_CLEARDSTTRAN_CLEAR_Pos                (0U)
#define DMA_CLEARDSTTRAN_CLEAR_Msk                (0x3FUL<<DMA_CLEARDSTTRAN_CLEAR_Pos)              /*!< 0x0000003F */
#define DMA_CLEARDSTTRAN_CLEAR                    DMA_CLEARDSTTRAN_CLEAR_Msk                        /*!< Clear for IntDstTran Interrupt */
#define DMA_CLEARDSTTRAN_CLEAR_0                  (0x1UL<<DMA_CLEARDSTTRAN_CLEAR_Pos)               /*!< 0x00000001 */
#define DMA_CLEARDSTTRAN_CLEAR_1                  (0x2UL<<DMA_CLEARDSTTRAN_CLEAR_Pos)               /*!< 0x00000002 */
#define DMA_CLEARDSTTRAN_CLEAR_2                  (0x4UL<<DMA_CLEARDSTTRAN_CLEAR_Pos)               /*!< 0x00000004 */
#define DMA_CLEARDSTTRAN_CLEAR_3                  (0x8UL<<DMA_CLEARDSTTRAN_CLEAR_Pos)               /*!< 0x00000008 */
#define DMA_CLEARDSTTRAN_CLEAR_4                  (0x10UL<<DMA_CLEARDSTTRAN_CLEAR_Pos)              /*!< 0x00000010 */
#define DMA_CLEARDSTTRAN_CLEAR_5                  (0x20UL<<DMA_CLEARDSTTRAN_CLEAR_Pos)              /*!< 0x00000020 */

/********************************* Bit definition for DMA_CLEARERR register *****************************************/
#define DMA_CLEARERR_CLEAR_Pos                    (0U)
#define DMA_CLEARERR_CLEAR_Msk                    (0x3FUL<<DMA_CLEARERR_CLEAR_Pos)                  /*!< 0x0000003F */
#define DMA_CLEARERR_CLEAR                        DMA_CLEARERR_CLEAR_Msk                            /*!< Clear for IntErr Interrupt */
#define DMA_CLEARERR_CLEAR_0                      (0x1UL<<DMA_CLEARERR_CLEAR_Pos)                   /*!< 0x00000001 */
#define DMA_CLEARERR_CLEAR_1                      (0x2UL<<DMA_CLEARERR_CLEAR_Pos)                   /*!< 0x00000002 */
#define DMA_CLEARERR_CLEAR_2                      (0x4UL<<DMA_CLEARERR_CLEAR_Pos)                   /*!< 0x00000004 */
#define DMA_CLEARERR_CLEAR_3                      (0x8UL<<DMA_CLEARERR_CLEAR_Pos)                   /*!< 0x00000008 */
#define DMA_CLEARERR_CLEAR_4                      (0x10UL<<DMA_CLEARERR_CLEAR_Pos)                  /*!< 0x00000010 */
#define DMA_CLEARERR_CLEAR_5                      (0x20UL<<DMA_CLEARERR_CLEAR_Pos)                  /*!< 0x00000020 */

/********************************* Bit definition for DMA_STATUSINT register ****************************************/
#define DMA_STATUSINT_TFR_Pos                     (0U)
#define DMA_STATUSINT_TFR_Msk                     (0x1UL<<DMA_STATUSINT_TFR_Pos)                    /*!< 0x00000001 */
#define DMA_STATUSINT_TFR                         DMA_STATUSINT_TFR_Msk                             /*!< OR of the contents of StatusTfr */
#define DMA_STATUSINT_BLOCK_Pos                   (1U)
#define DMA_STATUSINT_BLOCK_Msk                   (0x1UL<<DMA_STATUSINT_BLOCK_Pos)                  /*!< 0x00000002 */
#define DMA_STATUSINT_BLOCK                       DMA_STATUSINT_BLOCK_Msk                           /*!< OR of the contents of StatusBlock */
#define DMA_STATUSINT_SRCT_Pos                    (2U)
#define DMA_STATUSINT_SRCT_Msk                    (0x1UL<<DMA_STATUSINT_SRCT_Pos)                   /*!< 0x00000004 */
#define DMA_STATUSINT_SRCT                        DMA_STATUSINT_SRCT_Msk                            /*!< OR of the contents of StatusSrcTran */
#define DMA_STATUSINT_DSTT_Pos                    (3U)
#define DMA_STATUSINT_DSTT_Msk                    (0x1UL<<DMA_STATUSINT_DSTT_Pos)                   /*!< 0x00000008 */
#define DMA_STATUSINT_DSTT                        DMA_STATUSINT_DSTT_Msk                            /*!< OR of the contents of StatusDstTran */
#define DMA_STATUSINT_ERR_Pos                     (4U)
#define DMA_STATUSINT_ERR_Msk                     (0x1UL<<DMA_STATUSINT_ERR_Pos)                    /*!< 0x00000010 */
#define DMA_STATUSINT_ERR                         DMA_STATUSINT_ERR_Msk                             /*!< OR of the contents of StatusErr */
#define DMA_STATUSINT_HALFBLOCK_Pos               (5U)
#define DMA_STATUSINT_HALFBLOCK_Msk               (0x1UL<<DMA_STATUSINT_HALFBLOCK_Pos)              /*!< 0x00000020 */
#define DMA_STATUSINT_HALFBLOCK                   DMA_STATUSINT_HALFBLOCK_Msk                       /*!< OR of the contents of StatusHalfBlock */

/********************************* Bit definition for DMA_REQSRC register *******************************************/
#define DMA_REQSRC_SRC_REQ_Pos                    (0U)
#define DMA_REQSRC_SRC_REQ_Msk                    (0x3FUL<<DMA_REQSRC_SRC_REQ_Pos)                  /*!< 0x0000003F */
#define DMA_REQSRC_SRC_REQ                        DMA_REQSRC_SRC_REQ_Msk                            /*!< Source Software Transaction Request */
#define DMA_REQSRC_SRC_REQ_0                      (0x1UL<<DMA_REQSRC_SRC_REQ_Pos)                   /*!< 0x00000001 */
#define DMA_REQSRC_SRC_REQ_1                      (0x2UL<<DMA_REQSRC_SRC_REQ_Pos)                   /*!< 0x00000002 */
#define DMA_REQSRC_SRC_REQ_2                      (0x4UL<<DMA_REQSRC_SRC_REQ_Pos)                   /*!< 0x00000004 */
#define DMA_REQSRC_SRC_REQ_3                      (0x8UL<<DMA_REQSRC_SRC_REQ_Pos)                   /*!< 0x00000008 */
#define DMA_REQSRC_SRC_REQ_4                      (0x10UL<<DMA_REQSRC_SRC_REQ_Pos)                  /*!< 0x00000010 */
#define DMA_REQSRC_SRC_REQ_5                      (0x20UL<<DMA_REQSRC_SRC_REQ_Pos)                  /*!< 0x00000020 */
#define DMA_REQSRC_SRC_REQ_WE_Pos                 (8U)
#define DMA_REQSRC_SRC_REQ_WE_Msk                 (0x3FUL<<DMA_REQSRC_SRC_REQ_WE_Pos)               /*!< 0x00003F00 */
#define DMA_REQSRC_SRC_REQ_WE                     DMA_REQSRC_SRC_REQ_WE_Msk                         /*!< Source Software Transaction Request write enable */
#define DMA_REQSRC_SRC_REQ_WE_0                   (0x1UL<<DMA_REQSRC_SRC_REQ_WE_Pos)                /*!< 0x00000100 */
#define DMA_REQSRC_SRC_REQ_WE_1                   (0x2UL<<DMA_REQSRC_SRC_REQ_WE_Pos)                /*!< 0x00000200 */
#define DMA_REQSRC_SRC_REQ_WE_2                   (0x4UL<<DMA_REQSRC_SRC_REQ_WE_Pos)                /*!< 0x00000400 */
#define DMA_REQSRC_SRC_REQ_WE_3                   (0x8UL<<DMA_REQSRC_SRC_REQ_WE_Pos)                /*!< 0x00000800 */
#define DMA_REQSRC_SRC_REQ_WE_4                   (0x10UL<<DMA_REQSRC_SRC_REQ_WE_Pos)               /*!< 0x00001000 */
#define DMA_REQSRC_SRC_REQ_WE_5                   (0x20UL<<DMA_REQSRC_SRC_REQ_WE_Pos)               /*!< 0x00002000 */

/********************************* Bit definition for DMA_REQDST register *******************************************/
#define DMA_REQDST_DST_REQ_Pos                    (0U)
#define DMA_REQDST_DST_REQ_Msk                    (0x3FUL<<DMA_REQDST_DST_REQ_Pos)                  /*!< 0x0000003F */
#define DMA_REQDST_DST_REQ                        DMA_REQDST_DST_REQ_Msk                            /*!< Destination Software Transaction Request */
#define DMA_REQDST_DST_REQ_0                      (0x1UL<<DMA_REQDST_DST_REQ_Pos)                   /*!< 0x00000001 */
#define DMA_REQDST_DST_REQ_1                      (0x2UL<<DMA_REQDST_DST_REQ_Pos)                   /*!< 0x00000002 */
#define DMA_REQDST_DST_REQ_2                      (0x4UL<<DMA_REQDST_DST_REQ_Pos)                   /*!< 0x00000004 */
#define DMA_REQDST_DST_REQ_3                      (0x8UL<<DMA_REQDST_DST_REQ_Pos)                   /*!< 0x00000008 */
#define DMA_REQDST_DST_REQ_4                      (0x10UL<<DMA_REQDST_DST_REQ_Pos)                  /*!< 0x00000010 */
#define DMA_REQDST_DST_REQ_5                      (0x20UL<<DMA_REQDST_DST_REQ_Pos)                  /*!< 0x00000020 */
#define DMA_REQDST_DST_REQ_WE_Pos                 (8U)
#define DMA_REQDST_DST_REQ_WE_Msk                 (0x3FUL<<DMA_REQDST_DST_REQ_WE_Pos)               /*!< 0x00003F00 */
#define DMA_REQDST_DST_REQ_WE                     DMA_REQDST_DST_REQ_WE_Msk                         /*!< Destination Software Transaction Request write enable */
#define DMA_REQDST_DST_REQ_WE_0                   (0x1UL<<DMA_REQDST_DST_REQ_WE_Pos)                /*!< 0x00000100 */
#define DMA_REQDST_DST_REQ_WE_1                   (0x2UL<<DMA_REQDST_DST_REQ_WE_Pos)                /*!< 0x00000200 */
#define DMA_REQDST_DST_REQ_WE_2                   (0x4UL<<DMA_REQDST_DST_REQ_WE_Pos)                /*!< 0x00000400 */
#define DMA_REQDST_DST_REQ_WE_3                   (0x8UL<<DMA_REQDST_DST_REQ_WE_Pos)                /*!< 0x00000800 */
#define DMA_REQDST_DST_REQ_WE_4                   (0x10UL<<DMA_REQDST_DST_REQ_WE_Pos)               /*!< 0x00001000 */
#define DMA_REQDST_DST_REQ_WE_5                   (0x20UL<<DMA_REQDST_DST_REQ_WE_Pos)               /*!< 0x00002000 */

/********************************* Bit definition for DMA_SGLRQSRC register *****************************************/
#define DMA_SGLRQSRC_SRC_SGLREQ_Pos               (0U)
#define DMA_SGLRQSRC_SRC_SGLREQ_Msk               (0x3FUL<<DMA_SGLRQSRC_SRC_SGLREQ_Pos)             /*!< 0x0000003F */
#define DMA_SGLRQSRC_SRC_SGLREQ                   DMA_SGLRQSRC_SRC_SGLREQ_Msk                       /*!< Source Single Transaction Request */
#define DMA_SGLRQSRC_SRC_SGLREQ_0                 (0x1UL<<DMA_SGLRQSRC_SRC_SGLREQ_Pos)              /*!< 0x00000001 */
#define DMA_SGLRQSRC_SRC_SGLREQ_1                 (0x2UL<<DMA_SGLRQSRC_SRC_SGLREQ_Pos)              /*!< 0x00000002 */
#define DMA_SGLRQSRC_SRC_SGLREQ_2                 (0x4UL<<DMA_SGLRQSRC_SRC_SGLREQ_Pos)              /*!< 0x00000004 */
#define DMA_SGLRQSRC_SRC_SGLREQ_3                 (0x8UL<<DMA_SGLRQSRC_SRC_SGLREQ_Pos)              /*!< 0x00000008 */
#define DMA_SGLRQSRC_SRC_SGLREQ_4                 (0x10UL<<DMA_SGLRQSRC_SRC_SGLREQ_Pos)             /*!< 0x00000010 */
#define DMA_SGLRQSRC_SRC_SGLREQ_5                 (0x20UL<<DMA_SGLRQSRC_SRC_SGLREQ_Pos)             /*!< 0x00000020 */
#define DMA_SGLRQSRC_SRC_SGLREQ_WE_Pos            (8U)
#define DMA_SGLRQSRC_SRC_SGLREQ_WE_Msk            (0x3FUL<<DMA_SGLRQSRC_SRC_SGLREQ_WE_Pos)          /*!< 0x00003F00 */
#define DMA_SGLRQSRC_SRC_SGLREQ_WE                DMA_SGLRQSRC_SRC_SGLREQ_WE_Msk                    /*!< Source Single Transaction Request write enable */
#define DMA_SGLRQSRC_SRC_SGLREQ_WE_0              (0x1UL<<DMA_SGLRQSRC_SRC_SGLREQ_WE_Pos)           /*!< 0x00000100 */
#define DMA_SGLRQSRC_SRC_SGLREQ_WE_1              (0x2UL<<DMA_SGLRQSRC_SRC_SGLREQ_WE_Pos)           /*!< 0x00000200 */
#define DMA_SGLRQSRC_SRC_SGLREQ_WE_2              (0x4UL<<DMA_SGLRQSRC_SRC_SGLREQ_WE_Pos)           /*!< 0x00000400 */
#define DMA_SGLRQSRC_SRC_SGLREQ_WE_3              (0x8UL<<DMA_SGLRQSRC_SRC_SGLREQ_WE_Pos)           /*!< 0x00000800 */
#define DMA_SGLRQSRC_SRC_SGLREQ_WE_4              (0x10UL<<DMA_SGLRQSRC_SRC_SGLREQ_WE_Pos)          /*!< 0x00001000 */
#define DMA_SGLRQSRC_SRC_SGLREQ_WE_5              (0x20UL<<DMA_SGLRQSRC_SRC_SGLREQ_WE_Pos)          /*!< 0x00002000 */

/********************************* Bit definition for DMA_SGLRQDST register *****************************************/
#define DMA_SGLRQDST_DST_SGLREQ_Pos               (0U)
#define DMA_SGLRQDST_DST_SGLREQ_Msk               (0x3FUL<<DMA_SGLRQDST_DST_SGLREQ_Pos)             /*!< 0x0000003F */
#define DMA_SGLRQDST_DST_SGLREQ                   DMA_SGLRQDST_DST_SGLREQ_Msk                       /*!< Destination Single Transaction Request */
#define DMA_SGLRQDST_DST_SGLREQ_0                 (0x1UL<<DMA_SGLRQDST_DST_SGLREQ_Pos)              /*!< 0x00000001 */
#define DMA_SGLRQDST_DST_SGLREQ_1                 (0x2UL<<DMA_SGLRQDST_DST_SGLREQ_Pos)              /*!< 0x00000002 */
#define DMA_SGLRQDST_DST_SGLREQ_2                 (0x4UL<<DMA_SGLRQDST_DST_SGLREQ_Pos)              /*!< 0x00000004 */
#define DMA_SGLRQDST_DST_SGLREQ_3                 (0x8UL<<DMA_SGLRQDST_DST_SGLREQ_Pos)              /*!< 0x00000008 */
#define DMA_SGLRQDST_DST_SGLREQ_4                 (0x10UL<<DMA_SGLRQDST_DST_SGLREQ_Pos)             /*!< 0x00000010 */
#define DMA_SGLRQDST_DST_SGLREQ_5                 (0x20UL<<DMA_SGLRQDST_DST_SGLREQ_Pos)             /*!< 0x00000020 */
#define DMA_SGLRQDST_DST_SGLREQ_WE_Pos            (8U)
#define DMA_SGLRQDST_DST_SGLREQ_WE_Msk            (0x3FUL<<DMA_SGLRQDST_DST_SGLREQ_WE_Pos)          /*!< 0x00003F00 */
#define DMA_SGLRQDST_DST_SGLREQ_WE                DMA_SGLRQDST_DST_SGLREQ_WE_Msk                    /*!< Destination Single Transaction Request write enable */
#define DMA_SGLRQDST_DST_SGLREQ_WE_0              (0x1UL<<DMA_SGLRQDST_DST_SGLREQ_WE_Pos)           /*!< 0x00000100 */
#define DMA_SGLRQDST_DST_SGLREQ_WE_1              (0x2UL<<DMA_SGLRQDST_DST_SGLREQ_WE_Pos)           /*!< 0x00000200 */
#define DMA_SGLRQDST_DST_SGLREQ_WE_2              (0x4UL<<DMA_SGLRQDST_DST_SGLREQ_WE_Pos)           /*!< 0x00000400 */
#define DMA_SGLRQDST_DST_SGLREQ_WE_3              (0x8UL<<DMA_SGLRQDST_DST_SGLREQ_WE_Pos)           /*!< 0x00000800 */
#define DMA_SGLRQDST_DST_SGLREQ_WE_4              (0x10UL<<DMA_SGLRQDST_DST_SGLREQ_WE_Pos)          /*!< 0x00001000 */
#define DMA_SGLRQDST_DST_SGLREQ_WE_5              (0x20UL<<DMA_SGLRQDST_DST_SGLREQ_WE_Pos)          /*!< 0x00002000 */

