Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xC.h
/********************************************************************************************************************/
/********************************* OPA ******************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for OPA_CSR register *******************************************/
#define OPA_CSR_OPAEN_Pos                      (0U)
#define OPA_CSR_OPAEN_Msk                      (0x1UL<<OPA_CSR_OPAEN_Pos)                     /*!< 0x00000001 */
#define OPA_CSR_OPAEN                          OPA_CSR_OPAEN_Msk                              /*!< OPA Enable */
#define OPA_CSR_VP_SEL_Pos                     (2U)
#define OPA_CSR_VP_SEL_Msk                     (0x3UL<<OPA_CSR_VP_SEL_Pos)                    /*!< 0x0000000C */
#define OPA_CSR_VP_SEL                         OPA_CSR_VP_SEL_Msk                             /*!< Non reverse input selection */
#define OPA_CSR_VP_SEL_0                       (0x1UL<<OPA_CSR_VP_SEL_Pos)                    /*!< 0x00000004 */
#define OPA_CSR_VP_SEL_1                       (0x2UL<<OPA_CSR_VP_SEL_Pos)                    /*!< 0x00000008 */
#define OPA_CSR_VM_SEL_Pos                     (5U)
#define OPA_CSR_VM_SEL_Msk                     (0x3UL<<OPA_CSR_VM_SEL_Pos)                    /*!< 0x00000060 */
#define OPA_CSR_VM_SEL                         OPA_CSR_VM_SEL_Msk                             /*!< Reverse input selection */
#define OPA_CSR_VM_SEL_0                       (0x1UL<<OPA_CSR_VM_SEL_Pos)                    /*!< 0x00000020 */
#define OPA_CSR_VM_SEL_1                       (0x2UL<<OPA_CSR_VM_SEL_Pos)                    /*!< 0x00000040 */
#define OPA_CSR_OPAHSM_Pos                     (7U)
#define OPA_CSR_OPAHSM_Msk                     (0x1UL<<OPA_CSR_OPAHSM_Pos)                    /*!< 0x00000080 */
#define OPA_CSR_OPAHSM                         OPA_CSR_OPAHSM_Msk                             /*!< OPA high-speed mode */
#define OPA_CSR_OPAINTOEN_Pos                  (8U)
#define OPA_CSR_OPAINTOEN_Msk                  (0x1UL<<OPA_CSR_OPAINTOEN_Pos)                 /*!< 0x00000100 */
#define OPA_CSR_OPAINTOEN                      OPA_CSR_OPAINTOEN_Msk                          /*!< OPA internal output enable */
#define OPA_CSR_OPA_VBIAS_Pos                  (9U)
#define OPA_CSR_OPA_VBIAS_Msk                  (0x3UL<<OPA_CSR_OPA_VBIAS_Pos)                 /*!< 0x00000600 */
#define OPA_CSR_OPA_VBIAS                      OPA_CSR_OPA_VBIAS_Msk                          /*!< OPA Bias voltage selection */
#define OPA_CSR_OPA_VBIAS_0                    (0x1UL<<OPA_CSR_OPA_VBIAS_Pos)                 /*!< 0x00000200 */
#define OPA_CSR_OPA_VBIAS_1                    (0x2UL<<OPA_CSR_OPA_VBIAS_Pos)                 /*!< 0x00000400 */
#define OPA_CSR_PGA_GAIN_Pos                   (14U)
#define OPA_CSR_PGA_GAIN_Msk                   (0x1FUL<<OPA_CSR_PGA_GAIN_Pos)                 /*!< 0x0007C000 */
#define OPA_CSR_PGA_GAIN                       OPA_CSR_PGA_GAIN_Msk                           /*!< OPA configurable amplifier gain value */
#define OPA_CSR_PGA_GAIN_0                     (0x1UL<<OPA_CSR_PGA_GAIN_Pos)                  /*!< 0x00004000 */
#define OPA_CSR_PGA_GAIN_1                     (0x2UL<<OPA_CSR_PGA_GAIN_Pos)                  /*!< 0x00008000 */
#define OPA_CSR_PGA_GAIN_2                     (0x4UL<<OPA_CSR_PGA_GAIN_Pos)                  /*!< 0x00010000 */
#define OPA_CSR_PGA_GAIN_3                     (0x8UL<<OPA_CSR_PGA_GAIN_Pos)                  /*!< 0x00020000 */
#define OPA_CSR_PGA_GAIN_4                     (0x10UL<<OPA_CSR_PGA_GAIN_Pos)                 /*!< 0x00040000 */
#define OPA_CSR_OPA_VBSEL_Pos                  (29U)
#define OPA_CSR_OPA_VBSEL_Msk                  (0x1UL<<OPA_CSR_OPA_VBSEL_Pos)                 /*!< 0x20000000 */
#define OPA_CSR_OPA_VBSEL                      OPA_CSR_OPA_VBSEL_Msk                          /*!< OPA1 Bias selection */
#define OPA_CSR_LOCK_Pos                       (31U)
#define OPA_CSR_LOCK_Msk                       (0x1UL<<OPA_CSR_LOCK_Pos)                      /*!< 0x80000000 */
#define OPA_CSR_LOCK                           OPA_CSR_LOCK_Msk                               /*!< OPA_CSR register Lock */

/********************************* Bit definition for OPA_TCMR register ******************************************/
#define OPA_TCMR_VMS_SEL_Pos                   (0U)
#define OPA_TCMR_VMS_SEL_Msk                   (0x1UL<<OPA_TCMR_VMS_SEL_Pos)                  /*!< 0x00000001 */
#define OPA_TCMR_VMS_SEL                       OPA_TCMR_VMS_SEL_Msk                           /*!< OPAx reverse phase input secondary selection */
#define OPA_TCMR_VPS_SEL_Pos                   (1U)
#define OPA_TCMR_VPS_SEL_Msk                   (0x3UL<<OPA_TCMR_VPS_SEL_Pos)                  /*!< 0x00000006 */
#define OPA_TCMR_VPS_SEL                       OPA_TCMR_VPS_SEL_Msk                           /*!< OPAx non inverting input secondary selection */
#define OPA_TCMR_VPS_SEL_0                     (0x1UL<<OPA_TCMR_VPS_SEL_Pos)                  /*!< 0x00000002 */
#define OPA_TCMR_VPS_SEL_1                     (0x2UL<<OPA_TCMR_VPS_SEL_Pos)                  /*!< 0x00000004 */
#define OPA_TCMR_T1CM_EN_Pos                   (3U)
#define OPA_TCMR_T1CM_EN_Msk                   (0x1UL<<OPA_TCMR_T1CM_EN_Pos)                  /*!< 0x00000008 */
#define OPA_TCMR_T1CM_EN                       OPA_TCMR_T1CM_EN_Msk                           /*!< TIM1 Control Multiplexing Mode Enable */
#define OPA_TCMR_T8CM_EN_Pos                   (4U)
#define OPA_TCMR_T8CM_EN_Msk                   (0x1UL<<OPA_TCMR_T8CM_EN_Pos)                  /*!< 0x00000010 */
#define OPA_TCMR_T8CM_EN                       OPA_TCMR_T8CM_EN_Msk                           /*!< TIM8 Control Multiplexing Mode Enable */
#define OPA_TCMR_LOCK_Pos                      (31U)
#define OPA_TCMR_LOCK_Msk                      (0x1UL<<OPA_TCMR_LOCK_Pos)                     /*!< 0x80000000 */
#define OPA_TCMR_LOCK                          OPA_TCMR_LOCK_Msk                              /*!< OPA_TCMR register Lock */

