Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xC.h
/********************************* Bit definition for PWR_SCR register **********************************************/
#define PWR_SCR_CWUF_Pos                          (0U)
#define PWR_SCR_CWUF_Msk                          (0x1FUL<<PWR_SCR_CWUF_Pos)                        /*!< 0x0000001F */
#define PWR_SCR_CWUF                              PWR_SCR_CWUF_Msk                                 
#define PWR_SCR_CWUF1_Pos                         (0U)
#define PWR_SCR_CWUF1_Msk                         (0x1UL<<PWR_SCR_CWUF1_Pos)                        /*!< 0x00000001 */
#define PWR_SCR_CWUF1                             PWR_SCR_CWUF1_Msk                                 
#define PWR_SCR_CWUF2_Pos                         (1U)
#define PWR_SCR_CWUF2_Msk                         (0x1UL<<PWR_SCR_CWUF2_Pos)                        /*!< 0x00000002 */
#define PWR_SCR_CWUF2                             PWR_SCR_CWUF2_Msk                                 
#define PWR_SCR_CWUF3_Pos                         (2U)
#define PWR_SCR_CWUF3_Msk                         (0x1UL<<PWR_SCR_CWUF3_Pos)                        /*!< 0x00000004 */
#define PWR_SCR_CWUF3                             PWR_SCR_CWUF3_Msk                                 
#define PWR_SCR_CWUF4_Pos                         (3U)
#define PWR_SCR_CWUF4_Msk                         (0x1UL<<PWR_SCR_CWUF4_Pos)                        /*!< 0x00000008 */
#define PWR_SCR_CWUF4                             PWR_SCR_CWUF4_Msk                                 
#define PWR_SCR_CWUF5_Pos                         (4U)
#define PWR_SCR_CWUF5_Msk                         (0x1UL<<PWR_SCR_CWUF5_Pos)                        /*!< 0x00000010 */
#define PWR_SCR_CWUF5                             PWR_SCR_CWUF5_Msk                                 
#define PWR_SCR_CSBF_Pos                          (8U)
#define PWR_SCR_CSBF_Msk                          (0x1UL<<PWR_SCR_CSBF_Pos)                         /*!< 0x00000100 */
#define PWR_SCR_CSBF                              PWR_SCR_CSBF_Msk                                  

/********************************************************************************************************************/
/********************************* ESMC *****************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for ESMC_CR register **********************************************/
#define ESMC_CR_SOFTRST_Pos                       (0U)
#define ESMC_CR_SOFTRST_Msk                       (0x1UL<<ESMC_CR_SOFTRST_Pos)                      /*!< 0x00000001 */
#define ESMC_CR_SOFTRST                           ESMC_CR_SOFTRST_Msk                               /*!< Software Reset */
#define ESMC_CR_2QSPI_Pos                         (2U)
#define ESMC_CR_2QSPI_Msk                         (0x1UL<<ESMC_CR_2QSPI_Pos)                        /*!< 0x00000004 */
#define ESMC_CR_2QSPI                             ESMC_CR_2QSPI_Msk                                 /*!< Dual Flash Mode */
#define ESMC_CR_DMAEN_Pos                         (3U)
#define ESMC_CR_DMAEN_Msk                         (0x1UL<<ESMC_CR_DMAEN_Pos)                        /*!< 0x00000008 */
#define ESMC_CR_DMAEN                             ESMC_CR_DMAEN_Msk                                 /*!< dma en */
#define ESMC_CR_GIE_Pos                           (4U)
#define ESMC_CR_GIE_Msk                           (0x1UL<<ESMC_CR_GIE_Pos)                          /*!< 0x00000010 */
#define ESMC_CR_GIE                               ESMC_CR_GIE_Msk                                   /*!< globle interrupt enable  */
#define ESMC_CR_XIPEN_Pos                         (6U)
#define ESMC_CR_XIPEN_Msk                         (0x1UL<<ESMC_CR_XIPEN_Pos)                        /*!< 0x00000040 */
#define ESMC_CR_XIPEN                             ESMC_CR_XIPEN_Msk                                 /*!< xip mode en */
#define ESMC_CR_SPIEN_Pos                         (7U)
#define ESMC_CR_SPIEN_Msk                         (0x1UL<<ESMC_CR_SPIEN_Pos)                        /*!< 0x00000080 */
#define ESMC_CR_SPIEN                             ESMC_CR_SPIEN_Msk                                 /*!< spi en */

/********************************* Bit definition for ESMC_CR2 register *********************************************/
#define ESMC_CR2_CPHA_Pos                         (0U)
#define ESMC_CR2_CPHA_Msk                         (0x1UL<<ESMC_CR2_CPHA_Pos)                        /*!< 0x00000001 */
#define ESMC_CR2_CPHA                             ESMC_CR2_CPHA_Msk                                 /*!< clock phase */
#define ESMC_CR2_CPOL_Pos                         (1U)
#define ESMC_CR2_CPOL_Msk                         (0x1UL<<ESMC_CR2_CPOL_Pos)                        /*!< 0x00000002 */
#define ESMC_CR2_CPOL                             ESMC_CR2_CPOL_Msk                                 /*!< clock polarity  */
#define ESMC_CR2_TXFIFO_CLR_Pos                   (3U)
#define ESMC_CR2_TXFIFO_CLR_Msk                   (0x1UL<<ESMC_CR2_TXFIFO_CLR_Pos)                  /*!< 0x00000008 */
#define ESMC_CR2_TXFIFO_CLR                       ESMC_CR2_TXFIFO_CLR_Msk                           /*!< txfifo clear */
#define ESMC_CR2_RXFIFO_CLR_Pos                   (4U)
#define ESMC_CR2_RXFIFO_CLR_Msk                   (0x1UL<<ESMC_CR2_RXFIFO_CLR_Pos)                  /*!< 0x00000010 */
#define ESMC_CR2_RXFIFO_CLR                       ESMC_CR2_RXFIFO_CLR_Msk                           /*!< rxfifo clear */
#define ESMC_CR2_XSPI_DUAL_LAT_OFF_Pos            (7U)
#define ESMC_CR2_XSPI_DUAL_LAT_OFF_Msk            (0x1UL<<ESMC_CR2_XSPI_DUAL_LAT_OFF_Pos)           /*!< 0x00000080 */
#define ESMC_CR2_XSPI_DUAL_LAT_OFF                ESMC_CR2_XSPI_DUAL_LAT_OFF_Msk                    /*!< xspi dual latency off enable */

/********************************* Bit definition for ESMC_TCR register *********************************************/
#define ESMC_TCR_HOLD_Pos                         (0U)
#define ESMC_TCR_HOLD_Msk                         (0xFUL<<ESMC_TCR_HOLD_Pos)                        /*!< 0x0000000F */
#define ESMC_TCR_HOLD                             ESMC_TCR_HOLD_Msk                                 /*!< setup/hold time */
#define ESMC_TCR_HOLD_0                           (0x1UL<<ESMC_TCR_HOLD_Pos)                        /*!< 0x00000001 */
#define ESMC_TCR_HOLD_1                           (0x2UL<<ESMC_TCR_HOLD_Pos)                        /*!< 0x00000002 */
#define ESMC_TCR_HOLD_2                           (0x4UL<<ESMC_TCR_HOLD_Pos)                        /*!< 0x00000004 */
#define ESMC_TCR_HOLD_3                           (0x8UL<<ESMC_TCR_HOLD_Pos)                        /*!< 0x00000008 */
#define ESMC_TCR_HIGH_Pos                         (4U)
#define ESMC_TCR_HIGH_Msk                         (0xFUL<<ESMC_TCR_HIGH_Pos)                        /*!< 0x000000F0 */
#define ESMC_TCR_HIGH                             ESMC_TCR_HIGH_Msk                                 /*!< high time */
#define ESMC_TCR_HIGH_0                           (0x1UL<<ESMC_TCR_HIGH_Pos)                        /*!< 0x00000010 */
#define ESMC_TCR_HIGH_1                           (0x2UL<<ESMC_TCR_HIGH_Pos)                        /*!< 0x00000020 */
#define ESMC_TCR_HIGH_2                           (0x4UL<<ESMC_TCR_HIGH_Pos)                        /*!< 0x00000040 */
#define ESMC_TCR_HIGH_3                           (0x8UL<<ESMC_TCR_HIGH_Pos)                        /*!< 0x00000080 */

/********************************* Bit definition for ESMC_BAUD register ********************************************/
#define ESMC_BAUD_BAUD_Pos                        (0U)
#define ESMC_BAUD_BAUD_Msk                        (0xFFUL<<ESMC_BAUD_BAUD_Pos)                      /*!< 0x000000FF */
#define ESMC_BAUD_BAUD                            ESMC_BAUD_BAUD_Msk                                /*!< baud set */

/********************************* Bit definition for ESMC_SFCR register ********************************************/
#define ESMC_SFCR_SFCR0_Pos                       (0U)
#define ESMC_SFCR_SFCR0_Msk                       (0xFFUL<<ESMC_SFCR_SFCR0_Pos)                     /*!< 0x000000FF */
#define ESMC_SFCR_SFCR0                           ESMC_SFCR_SFCR0_Msk                               /*!< Command Only */

/********************************* Bit definition for ESMC_SOCR register ********************************************/
#define ESMC_SOCR_SPIMODE_Pos                     (0U)
#define ESMC_SOCR_SPIMODE_Msk                     (0x3UL<<ESMC_SOCR_SPIMODE_Pos)                    /*!< 0x00000003 */
#define ESMC_SOCR_SPIMODE                         ESMC_SOCR_SPIMODE_Msk                             /*!< spi mode */
#define ESMC_SOCR_SPIMODE_0                       (0x1UL<<ESMC_SOCR_SPIMODE_Pos)                    /*!< 0x00000001 */
#define ESMC_SOCR_SPIMODE_1                       (0x2UL<<ESMC_SOCR_SPIMODE_Pos)                    /*!< 0x00000002 */
#define ESMC_SOCR_SENM_Pos                        (2U)
#define ESMC_SOCR_SENM_Msk                        (0x1UL<<ESMC_SOCR_SENM_Pos)                       /*!< 0x00000004 */
#define ESMC_SOCR_SENM                            ESMC_SOCR_SENM_Msk                                /*!< send mode enable */
#define ESMC_SOCR_MULTICMD_Pos                    (3U)
#define ESMC_SOCR_MULTICMD_Msk                    (0x1UL<<ESMC_SOCR_MULTICMD_Pos)                   /*!< 0x00000008 */
#define ESMC_SOCR_MULTICMD                        ESMC_SOCR_MULTICMD_Msk                            /*!< muti command  */
#define ESMC_SOCR_MULTIADDR_Pos                   (4U)
#define ESMC_SOCR_MULTIADDR_Msk                   (0x1UL<<ESMC_SOCR_MULTIADDR_Pos)                  /*!< 0x00000010 */
#define ESMC_SOCR_MULTIADDR                       ESMC_SOCR_MULTIADDR_Msk                           /*!< muti address */
#define ESMC_SOCR_DDRCMD_Pos                      (5U)
#define ESMC_SOCR_DDRCMD_Msk                      (0x1UL<<ESMC_SOCR_DDRCMD_Pos)                     /*!< 0x00000020 */
#define ESMC_SOCR_DDRCMD                          ESMC_SOCR_DDRCMD_Msk                              /*!< ddr command */
#define ESMC_SOCR_DDRADDR_Pos                     (6U)
#define ESMC_SOCR_DDRADDR_Msk                     (0x1UL<<ESMC_SOCR_DDRADDR_Pos)                    /*!< 0x00000040 */
#define ESMC_SOCR_DDRADDR                         ESMC_SOCR_DDRADDR_Msk                             /*!< ddr address */
#define ESMC_SOCR_DDRDATA_Pos                     (7U)
#define ESMC_SOCR_DDRDATA_Msk                     (0x1UL<<ESMC_SOCR_DDRDATA_Pos)                    /*!< 0x00000080 */
#define ESMC_SOCR_DDRDATA                         ESMC_SOCR_DDRDATA_Msk                             /*!< ddr data */

/********************************* Bit definition for ESMC_DCR register *********************************************/
#define ESMC_DCR_DUMMY_Pos                        (0U)
#define ESMC_DCR_DUMMY_Msk                        (0x3FUL<<ESMC_DCR_DUMMY_Pos)                      /*!< 0x0000003F */
#define ESMC_DCR_DUMMY                            ESMC_DCR_DUMMY_Msk                                /*!< dummy cycyle set */
#define ESMC_DCR_DUMMY_0                          (0x1UL<<ESMC_DCR_DUMMY_Pos)                       /*!< 0x00000001 */
#define ESMC_DCR_DUMMY_1                          (0x2UL<<ESMC_DCR_DUMMY_Pos)                       /*!< 0x00000002 */
#define ESMC_DCR_DUMMY_2                          (0x4UL<<ESMC_DCR_DUMMY_Pos)                       /*!< 0x00000004 */
#define ESMC_DCR_DUMMY_3                          (0x8UL<<ESMC_DCR_DUMMY_Pos)                       /*!< 0x00000008 */
#define ESMC_DCR_DUMMY_4                          (0x10UL<<ESMC_DCR_DUMMY_Pos)                      /*!< 0x00000010 */
#define ESMC_DCR_DUMMY_5                          (0x20UL<<ESMC_DCR_DUMMY_Pos)                      /*!< 0x00000020 */
#define ESMC_DCR_NO_CMD_Pos                       (6U)
#define ESMC_DCR_NO_CMD_Msk                       (0x1UL<<ESMC_DCR_NO_CMD_Pos)                      /*!< 0x00000040 */
#define ESMC_DCR_NO_CMD                           ESMC_DCR_NO_CMD_Msk                               /*!< no command  */
#define ESMC_DCR_REC_Pos                          (7U)
#define ESMC_DCR_REC_Msk                          (0x1UL<<ESMC_DCR_REC_Pos)                         /*!< 0x00000080 */
#define ESMC_DCR_REC                              ESMC_DCR_REC_Msk                                  /*!< receive enable  */

/********************************* Bit definition for ESMC_CR3 register *********************************************/
#define ESMC_CR3_ADDR8BIT_Pos                     (0U)
#define ESMC_CR3_ADDR8BIT_Msk                     (0x1UL<<ESMC_CR3_ADDR8BIT_Pos)                    /*!< 0x00000001 */
#define ESMC_CR3_ADDR8BIT                         ESMC_CR3_ADDR8BIT_Msk                             /*!< 8bit address */
#define ESMC_CR3_ADDR16BIT_Pos                    (1U)
#define ESMC_CR3_ADDR16BIT_Msk                    (0x1UL<<ESMC_CR3_ADDR16BIT_Pos)                   /*!< 0x00000002 */
#define ESMC_CR3_ADDR16BIT                        ESMC_CR3_ADDR16BIT_Msk                            /*!< 16bit address */
#define ESMC_CR3_ADDR32BIT_Pos                    (2U)
#define ESMC_CR3_ADDR32BIT_Msk                    (0x1UL<<ESMC_CR3_ADDR32BIT_Pos)                   /*!< 0x00000004 */
#define ESMC_CR3_ADDR32BIT                        ESMC_CR3_ADDR32BIT_Msk                            /*!< 32bit address */
#define ESMC_CR3_NO_ADDR_Pos                      (3U)
#define ESMC_CR3_NO_ADDR_Msk                      (0x1UL<<ESMC_CR3_NO_ADDR_Pos)                     /*!< 0x00000008 */
#define ESMC_CR3_NO_ADDR                          ESMC_CR3_NO_ADDR_Msk                              /*!< no address enable */
#define ESMC_CR3_XSPI_RWDS_Pos                    (4U)
#define ESMC_CR3_XSPI_RWDS_Msk                    (0x1UL<<ESMC_CR3_XSPI_RWDS_Pos)                   /*!< 0x00000010 */
#define ESMC_CR3_XSPI_RWDS                        ESMC_CR3_XSPI_RWDS_Msk                            /*!< xSPI RWDS enable */
#define ESMC_CR3_CMD_EXT_Pos                      (5U)
#define ESMC_CR3_CMD_EXT_Msk                      (0x1UL<<ESMC_CR3_CMD_EXT_Pos)                     /*!< 0x00000020 */
#define ESMC_CR3_CMD_EXT                          ESMC_CR3_CMD_EXT_Msk                              /*!< command extend enable */
#define ESMC_CR3_NO_DATA_Pos                      (7U)
#define ESMC_CR3_NO_DATA_Msk                      (0x1UL<<ESMC_CR3_NO_DATA_Pos)                     /*!< 0x00000080 */
#define ESMC_CR3_NO_DATA                          ESMC_CR3_NO_DATA_Msk                              /*!< no data enable */

/********************************* Bit definition for ESMC_ADDR24 register ******************************************/
#define ESMC_ADDR24_INS1_Pos                      (0U)
#define ESMC_ADDR24_INS1_Msk                      (0xFFUL<<ESMC_ADDR24_INS1_Pos)                    /*!< 0x000000FF */
#define ESMC_ADDR24_INS1                          ESMC_ADDR24_INS1_Msk                              /*!< command1 */
#define ESMC_ADDR24_ADDR0_Pos                     (8U)
#define ESMC_ADDR24_ADDR0_Msk                     (0xFFUL<<ESMC_ADDR24_ADDR0_Pos)                   /*!< 0x0000FF00 */
#define ESMC_ADDR24_ADDR0                         ESMC_ADDR24_ADDR0_Msk                             /*!< address0 */
#define ESMC_ADDR24_ADDR1_Pos                     (16U)
#define ESMC_ADDR24_ADDR1_Msk                     (0xFFUL<<ESMC_ADDR24_ADDR1_Pos)                   /*!< 0x00FF0000 */
#define ESMC_ADDR24_ADDR1                         ESMC_ADDR24_ADDR1_Msk                             /*!< address1 */
#define ESMC_ADDR24_ADDR2_Pos                     (24U)
#define ESMC_ADDR24_ADDR2_Msk                     (0xFFUL<<ESMC_ADDR24_ADDR2_Pos)                   /*!< 0xFF000000 */
#define ESMC_ADDR24_ADDR2                         ESMC_ADDR24_ADDR2_Msk                             /*!< address2 */

/********************************* Bit definition for ESMC_ADDR32 register ******************************************/
#define ESMC_ADDR32_ADDR3_Pos                     (0U)
#define ESMC_ADDR32_ADDR3_Msk                     (0xFFUL<<ESMC_ADDR32_ADDR3_Pos)                   /*!< 0x000000FF */
#define ESMC_ADDR32_ADDR3                         ESMC_ADDR32_ADDR3_Msk                             /*!< address3 */
#define ESMC_ADDR32_MREG_Pos                      (8U)
#define ESMC_ADDR32_MREG_Msk                      (0xFFUL<<ESMC_ADDR32_MREG_Pos)                    /*!< 0x0000FF00 */
#define ESMC_ADDR32_MREG                          ESMC_ADDR32_MREG_Msk                              /*!< Mode register */
#define ESMC_ADDR32_SSXO_Pos                      (16U)
#define ESMC_ADDR32_SSXO_Msk                      (0x3FUL<<ESMC_ADDR32_SSXO_Pos)                    /*!< 0x003F0000 */
#define ESMC_ADDR32_SSXO                          ESMC_ADDR32_SSXO_Msk                              /*!< Slave select enable */
#define ESMC_ADDR32_SSXO_0                        (0x1UL<<ESMC_ADDR32_SSXO_Pos)                     /*!< 0x00010000 */
#define ESMC_ADDR32_SSXO_1                        (0x2UL<<ESMC_ADDR32_SSXO_Pos)                     /*!< 0x00020000 */
#define ESMC_ADDR32_SSXO_2                        (0x4UL<<ESMC_ADDR32_SSXO_Pos)                     /*!< 0x00040000 */
#define ESMC_ADDR32_SSXO_3                        (0x8UL<<ESMC_ADDR32_SSXO_Pos)                     /*!< 0x00080000 */
#define ESMC_ADDR32_SSXO_4                        (0x10UL<<ESMC_ADDR32_SSXO_Pos)                    /*!< 0x00100000 */
#define ESMC_ADDR32_SSXO_5                        (0x20UL<<ESMC_ADDR32_SSXO_Pos)                    /*!< 0x00200000 */
#define ESMC_ADDR32_SS_CLR_Pos                    (22U)
#define ESMC_ADDR32_SS_CLR_Msk                    (0x1UL<<ESMC_ADDR32_SS_CLR_Pos)                   /*!< 0x00400000 */
#define ESMC_ADDR32_SS_CLR                        ESMC_ADDR32_SS_CLR_Msk                            /*!< Slave select clear */
#define ESMC_ADDR32_SS_SET_Pos                    (23U)
#define ESMC_ADDR32_SS_SET_Msk                    (0x1UL<<ESMC_ADDR32_SS_SET_Pos)                   /*!< 0x00800000 */
#define ESMC_ADDR32_SS_SET                        ESMC_ADDR32_SS_SET_Msk                            /*!< Slave select set */

/********************************* Bit definition for ESMC_DATA register ********************************************/
#define ESMC_DATA_DATA0_Pos                       (0U)
#define ESMC_DATA_DATA0_Msk                       (0xFFUL<<ESMC_DATA_DATA0_Pos)                     /*!< 0x000000FF */
#define ESMC_DATA_DATA0                           ESMC_DATA_DATA0_Msk                               /*!< data0 */
#define ESMC_DATA_DATA1_Pos                       (8U)
#define ESMC_DATA_DATA1_Msk                       (0xFFUL<<ESMC_DATA_DATA1_Pos)                     /*!< 0x0000FF00 */
#define ESMC_DATA_DATA1                           ESMC_DATA_DATA1_Msk                               /*!< data1 */
#define ESMC_DATA_DATA2_Pos                       (16U)
#define ESMC_DATA_DATA2_Msk                       (0xFFUL<<ESMC_DATA_DATA2_Pos)                     /*!< 0x00FF0000 */
#define ESMC_DATA_DATA2                           ESMC_DATA_DATA2_Msk                               /*!< data2 */
#define ESMC_DATA_DATA3_Pos                       (24U)
#define ESMC_DATA_DATA3_Msk                       (0xFFUL<<ESMC_DATA_DATA3_Pos)                     /*!< 0xFF000000 */
#define ESMC_DATA_DATA3                           ESMC_DATA_DATA3_Msk                               /*!< data3 */

/********************************* Bit definition for ESMC_SR register **********************************************/
#define ESMC_SR_SSACTIVE_Pos                      (0U)
#define ESMC_SR_SSACTIVE_Msk                      (0x1UL<<ESMC_SR_SSACTIVE_Pos)                     /*!< 0x00000001 */
#define ESMC_SR_SSACTIVE                          ESMC_SR_SSACTIVE_Msk                              /*!< slave select active */
#define ESMC_SR_RXBUSY_Pos                        (1U)
#define ESMC_SR_RXBUSY_Msk                        (0x1UL<<ESMC_SR_RXBUSY_Pos)                       /*!< 0x00000002 */
#define ESMC_SR_RXBUSY                            ESMC_SR_RXBUSY_Msk                                /*!< rx busy state */
#define ESMC_SR_TXBUSY_Pos                        (2U)
#define ESMC_SR_TXBUSY_Msk                        (0x1UL<<ESMC_SR_TXBUSY_Pos)                       /*!< 0x00000004 */
#define ESMC_SR_TXBUSY                            ESMC_SR_TXBUSY_Msk                                /*!< tx busy state */
#define ESMC_SR_XIPBUSY_Pos                       (3U)
#define ESMC_SR_XIPBUSY_Msk                       (0x1UL<<ESMC_SR_XIPBUSY_Pos)                      /*!< 0x00000008 */
#define ESMC_SR_XIPBUSY                           ESMC_SR_XIPBUSY_Msk                               /*!< xip busy state */
#define ESMC_SR_IDLE_STATE_Pos                    (4U)
#define ESMC_SR_IDLE_STATE_Msk                    (0x1UL<<ESMC_SR_IDLE_STATE_Pos)                   /*!< 0x00000010 */
#define ESMC_SR_IDLE_STATE                        ESMC_SR_IDLE_STATE_Msk                            /*!< idle state */
#define ESMC_SR_TXFIFOOV_Pos                      (5U)
#define ESMC_SR_TXFIFOOV_Msk                      (0x1UL<<ESMC_SR_TXFIFOOV_Pos)                     /*!< 0x00000020 */
#define ESMC_SR_TXFIFOOV                          ESMC_SR_TXFIFOOV_Msk                              /*!< txfifo overflow state */
#define ESMC_SR_DATAWAIT_Pos                      (6U)
#define ESMC_SR_DATAWAIT_Msk                      (0x1UL<<ESMC_SR_DATAWAIT_Pos)                     /*!< 0x00000040 */
#define ESMC_SR_DATAWAIT                          ESMC_SR_DATAWAIT_Msk                              /*!< data wait */
#define ESMC_SR_SPIF_Pos                          (7U)
#define ESMC_SR_SPIF_Msk                          (0x1UL<<ESMC_SR_SPIF_Pos)                         /*!< 0x00000080 */
#define ESMC_SR_SPIF                              ESMC_SR_SPIF_Msk                                  /*!< spi interrupt flag */

/********************************* Bit definition for ESMC_SR1 register *********************************************/
#define ESMC_SR1_RWDSI_ND_Pos                     (0U)
#define ESMC_SR1_RWDSI_ND_Msk                     (0x1UL<<ESMC_SR1_RWDSI_ND_Pos)                    /*!< 0x00000001 */
#define ESMC_SR1_RWDSI_ND                         ESMC_SR1_RWDSI_ND_Msk                             /*!< rwdsi not detect */
#define ESMC_SR1_XSPI_DUAL_LATENCY_Pos            (1U)
#define ESMC_SR1_XSPI_DUAL_LATENCY_Msk            (0x1UL<<ESMC_SR1_XSPI_DUAL_LATENCY_Pos)           /*!< 0x00000002 */
#define ESMC_SR1_XSPI_DUAL_LATENCY                ESMC_SR1_XSPI_DUAL_LATENCY_Msk                    /*!< xspi dual latency flag */

