Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xC.h
/********************************* Bit definition for ESMC_IER2 register ********************************************/
#define ESMC_IER2_TXFIFOEIE_Pos                   (1U)
#define ESMC_IER2_TXFIFOEIE_Msk                   (0x1UL<<ESMC_IER2_TXFIFOEIE_Pos)                  /*!< 0x00000002 */
#define ESMC_IER2_TXFIFOEIE                       ESMC_IER2_TXFIFOEIE_Msk                           /*!< tx fifo empty  interrupt enable */
#define ESMC_IER2_TXFIFOHEIE_Pos                  (2U)
#define ESMC_IER2_TXFIFOHEIE_Msk                  (0x1UL<<ESMC_IER2_TXFIFOHEIE_Pos)                 /*!< 0x00000004 */
#define ESMC_IER2_TXFIFOHEIE                      ESMC_IER2_TXFIFOHEIE_Msk                          /*!< tx fifo half full  interrupt enable */
#define ESMC_IER2_TXFIFOFIE_Pos                   (3U)
#define ESMC_IER2_TXFIFOFIE_Msk                   (0x1UL<<ESMC_IER2_TXFIFOFIE_Pos)                  /*!< 0x00000008 */
#define ESMC_IER2_TXFIFOFIE                       ESMC_IER2_TXFIFOFIE_Msk                           /*!< tx fifo full interrupt enable */
#define ESMC_IER2_TXFIFOOVIE_Pos                  (4U)
#define ESMC_IER2_TXFIFOOVIE_Msk                  (0x1UL<<ESMC_IER2_TXFIFOOVIE_Pos)                 /*!< 0x00000010 */
#define ESMC_IER2_TXFIFOOVIE                      ESMC_IER2_TXFIFOOVIE_Msk                          /*!< tx fifo overflow interrupt enable */
#define ESMC_IER2_TXWORDOVIE_Pos                  (5U)
#define ESMC_IER2_TXWORDOVIE_Msk                  (0x1UL<<ESMC_IER2_TXWORDOVIE_Pos)                 /*!< 0x00000020 */
#define ESMC_IER2_TXWORDOVIE                      ESMC_IER2_TXWORDOVIE_Msk                          /*!< txfifo word interrupt enable */

/********************************* Bit definition for ESMC_STRR register ********************************************/
#define ESMC_STRR_SMP_Pos                         (0U)
#define ESMC_STRR_SMP_Msk                         (0x3FUL<<ESMC_STRR_SMP_Pos)                       /*!< 0x0000003F */
#define ESMC_STRR_SMP                             ESMC_STRR_SMP_Msk                                 /*!< sample  */
#define ESMC_STRR_SMP_0                           (0x1UL<<ESMC_STRR_SMP_Pos)                        /*!< 0x00000001 */
#define ESMC_STRR_SMP_1                           (0x2UL<<ESMC_STRR_SMP_Pos)                        /*!< 0x00000002 */
#define ESMC_STRR_SMP_2                           (0x4UL<<ESMC_STRR_SMP_Pos)                        /*!< 0x00000004 */
#define ESMC_STRR_SMP_3                           (0x8UL<<ESMC_STRR_SMP_Pos)                        /*!< 0x00000008 */
#define ESMC_STRR_SMP_4                           (0x10UL<<ESMC_STRR_SMP_Pos)                       /*!< 0x00000010 */
#define ESMC_STRR_SMP_5                           (0x20UL<<ESMC_STRR_SMP_Pos)                       /*!< 0x00000020 */

/********************************* Bit definition for ESMC_XSFCR register *******************************************/
#define ESMC_XSFCR_XINS_Pos                       (0U)
#define ESMC_XSFCR_XINS_Msk                       (0xFFUL<<ESMC_XSFCR_XINS_Pos)                     /*!< 0x000000FF */
#define ESMC_XSFCR_XINS                           ESMC_XSFCR_XINS_Msk                               /*!< XIP read command */

/********************************* Bit definition for ESMC_XSOCR register *******************************************/
#define ESMC_XSOCR_SPI_MODE_Pos                   (0U)
#define ESMC_XSOCR_SPI_MODE_Msk                   (0x3UL<<ESMC_XSOCR_SPI_MODE_Pos)                  /*!< 0x00000003 */
#define ESMC_XSOCR_SPI_MODE                       ESMC_XSOCR_SPI_MODE_Msk                           /*!< xip read spi mode */
#define ESMC_XSOCR_SPI_MODE_0                     (0x1UL<<ESMC_XSOCR_SPI_MODE_Pos)                  /*!< 0x00000001 */
#define ESMC_XSOCR_SPI_MODE_1                     (0x2UL<<ESMC_XSOCR_SPI_MODE_Pos)                  /*!< 0x00000002 */
#define ESMC_XSOCR_SEND_M_Pos                     (2U)
#define ESMC_XSOCR_SEND_M_Msk                     (0x1UL<<ESMC_XSOCR_SEND_M_Pos)                    /*!< 0x00000004 */
#define ESMC_XSOCR_SEND_M                         ESMC_XSOCR_SEND_M_Msk                             /*!< xip read send mode enable */
#define ESMC_XSOCR_MULTICMD_Pos                   (3U)
#define ESMC_XSOCR_MULTICMD_Msk                   (0x1UL<<ESMC_XSOCR_MULTICMD_Pos)                  /*!< 0x00000008 */
#define ESMC_XSOCR_MULTICMD                       ESMC_XSOCR_MULTICMD_Msk                           /*!< xip read muti command  */
#define ESMC_XSOCR_MULTIADDR_Pos                  (4U)
#define ESMC_XSOCR_MULTIADDR_Msk                  (0x1UL<<ESMC_XSOCR_MULTIADDR_Pos)                 /*!< 0x00000010 */
#define ESMC_XSOCR_MULTIADDR                      ESMC_XSOCR_MULTIADDR_Msk                          /*!< xip read muti address */
#define ESMC_XSOCR_DDRCMD_Pos                     (5U)
#define ESMC_XSOCR_DDRCMD_Msk                     (0x1UL<<ESMC_XSOCR_DDRCMD_Pos)                    /*!< 0x00000020 */
#define ESMC_XSOCR_DDRCMD                         ESMC_XSOCR_DDRCMD_Msk                             /*!< xip read ddr command */
#define ESMC_XSOCR_DDRADDR_Pos                    (6U)
#define ESMC_XSOCR_DDRADDR_Msk                    (0x1UL<<ESMC_XSOCR_DDRADDR_Pos)                   /*!< 0x00000040 */
#define ESMC_XSOCR_DDRADDR                        ESMC_XSOCR_DDRADDR_Msk                            /*!< xip read ddr address */
#define ESMC_XSOCR_DDRDATA_Pos                    (7U)
#define ESMC_XSOCR_DDRDATA_Msk                    (0x1UL<<ESMC_XSOCR_DDRDATA_Pos)                   /*!< 0x00000080 */
#define ESMC_XSOCR_DDRDATA                        ESMC_XSOCR_DDRDATA_Msk                            /*!< xip read ddr data */

/********************************* Bit definition for ESMC_XDCR register ********************************************/
#define ESMC_XDCR_XDUMMY_Pos                      (0U)
#define ESMC_XDCR_XDUMMY_Msk                      (0x3FUL<<ESMC_XDCR_XDUMMY_Pos)                    /*!< 0x0000003F */
#define ESMC_XDCR_XDUMMY                          ESMC_XDCR_XDUMMY_Msk                              /*!< xip read dummy cycle set */
#define ESMC_XDCR_XDUMMY_0                        (0x1UL<<ESMC_XDCR_XDUMMY_Pos)                     /*!< 0x00000001 */
#define ESMC_XDCR_XDUMMY_1                        (0x2UL<<ESMC_XDCR_XDUMMY_Pos)                     /*!< 0x00000002 */
#define ESMC_XDCR_XDUMMY_2                        (0x4UL<<ESMC_XDCR_XDUMMY_Pos)                     /*!< 0x00000004 */
#define ESMC_XDCR_XDUMMY_3                        (0x8UL<<ESMC_XDCR_XDUMMY_Pos)                     /*!< 0x00000008 */
#define ESMC_XDCR_XDUMMY_4                        (0x10UL<<ESMC_XDCR_XDUMMY_Pos)                    /*!< 0x00000010 */
#define ESMC_XDCR_XDUMMY_5                        (0x20UL<<ESMC_XDCR_XDUMMY_Pos)                    /*!< 0x00000020 */
#define ESMC_XDCR_NO_CMD_Pos                      (6U)
#define ESMC_XDCR_NO_CMD_Msk                      (0x1UL<<ESMC_XDCR_NO_CMD_Pos)                     /*!< 0x00000040 */
#define ESMC_XDCR_NO_CMD                          ESMC_XDCR_NO_CMD_Msk                              /*!< xip read no command  */

