Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xC.h
#define RCC_CFGR_PPRE1_Pos                        (8U)
#define RCC_CFGR_PPRE1_Msk                        (0x7UL<<RCC_CFGR_PPRE1_Pos)                       /*!< 0x00000700 */
#define RCC_CFGR_PPRE1                            RCC_CFGR_PPRE1_Msk
#define RCC_CFGR_PPRE1_0                          (0x1UL<<RCC_CFGR_PPRE1_Pos)                       /*!< 0x00000100 */
#define RCC_CFGR_PPRE1_1                          (0x2UL<<RCC_CFGR_PPRE1_Pos)                       /*!< 0x00000200 */
#define RCC_CFGR_PPRE1_2                          (0x4UL<<RCC_CFGR_PPRE1_Pos)                       /*!< 0x00000400 */
#define RCC_CFGR_PPRE1_DIV1                       (0x00000000U)                                     /*!< HCLK not divided */
#define RCC_CFGR_PPRE1_DIV2                       (0x00000400U)                                     /*!< HCLK divided by 2 */
#define RCC_CFGR_PPRE1_DIV4                       (0x00000500U)                                     /*!< HCLK divided by 4 */
#define RCC_CFGR_PPRE1_DIV8                       (0x00000600U)                                     /*!< HCLK divided by 8 */
#define RCC_CFGR_PPRE1_DIV16                      (0x00000700U)   

#define RCC_CFGR_PPRE2_Pos                        (11U)
#define RCC_CFGR_PPRE2_Msk                        (0x7UL<<RCC_CFGR_PPRE2_Pos)                       /*!< 0x00003800 */
#define RCC_CFGR_PPRE2                            RCC_CFGR_PPRE2_Msk
#define RCC_CFGR_PPRE2_0                          (0x1UL<<RCC_CFGR_PPRE2_Pos)                       /*!< 0x00000800 */
#define RCC_CFGR_PPRE2_1                          (0x2UL<<RCC_CFGR_PPRE2_Pos)                       /*!< 0x00001000 */
#define RCC_CFGR_PPRE2_2                          (0x4UL<<RCC_CFGR_PPRE2_Pos)                       /*!< 0x00002000 */
#define RCC_CFGR_PPRE2_DIV1                       (0x00000000U)                                     /*!< HCLK not divided */
#define RCC_CFGR_PPRE2_DIV2                       (0x00002000U)                                     /*!< HCLK divided by 2 */
#define RCC_CFGR_PPRE2_DIV4                       (0x00002800U)                                     /*!< HCLK divided by 4 */
#define RCC_CFGR_PPRE2_DIV8                       (0x00003000U)                                     /*!< HCLK divided by 8 */
#define RCC_CFGR_PPRE2_DIV16                      (0x00003800U)                                     /*!< HCLK divided by 16 */
#define RCC_CFGR_ADCPRE_Pos                       (16U)
#define RCC_CFGR_ADCPRE_Msk                       (0x7UL<<RCC_CFGR_ADCPRE_Pos)                      /*!< 0x00070000 */
#define RCC_CFGR_ADCPRE                           RCC_CFGR_ADCPRE_Msk
#define RCC_CFGR_ADCPRE_0                         (0x1UL<<RCC_CFGR_ADCPRE_Pos)                      /*!< 0x00010000 */
#define RCC_CFGR_ADCPRE_1                         (0x2UL<<RCC_CFGR_ADCPRE_Pos)                      /*!< 0x00020000 */
#define RCC_CFGR_ADCPRE_2                         (0x4UL<<RCC_CFGR_ADCPRE_Pos)                      /*!< 0x00040000 */
#define RCC_CFGR_ADCPRE_DIV2                      (0x00000000U)                                     /*!< PCLK2 divided by 2 */
#define RCC_CFGR_ADCPRE_DIV4                      (0x00010000U)                                     /*!< PCLK2 divided by 4 */
#define RCC_CFGR_ADCPRE_DIV6                      (0x00020000U)                                     /*!< PCLK2 divided by 6 */
#define RCC_CFGR_ADCPRE_DIV8                      (0x00030000U)                                     /*!< PCLK2 divided by 8 */
#define RCC_CFGR_ADCPRE_DIV12                     (0x00050000U)                                     /*!< PCLK2 divided by 12 */
#define RCC_CFGR_ADCPRE_DIV16                     (0x00070000U)                                     /*!< PCLK2 divided by 16 */

#define RCC_CFGR_USBPRE_Pos                       (20U)
#define RCC_CFGR_USBPRE_Msk                       (0x7UL<<RCC_CFGR_USBPRE_Pos)                      /*!< 0x00700000 */
#define RCC_CFGR_USBPRE                           RCC_CFGR_USBPRE_Msk
#define RCC_CFGR_USBPRE_0                         (0x1UL<<RCC_CFGR_USBPRE_Pos)                      /*!< 0x00100000 */
#define RCC_CFGR_USBPRE_1                         (0x2UL<<RCC_CFGR_USBPRE_Pos)                      /*!< 0x00200000 */
#define RCC_CFGR_USBPRE_2                         (0x4UL<<RCC_CFGR_USBPRE_Pos)                      /*!< 0x00400000 */
#define RCC_CFGR_USBPRE_DIV1P5                    (0x00000000U)                                     /*!< USBCLK divided by 1.5 */
#define RCC_CFGR_USBPRE_DIV1                      (0x00100000U)                                     /*!< USBCLK divided by 1 */
#define RCC_CFGR_USBPRE_DIV2P5                    (0x00200000U)                                     /*!< USBCLK divided by 2.5 */
#define RCC_CFGR_USBPRE_DIV2                      (0x00300000U)                                     /*!< USBCLK divided by 2 */
#define RCC_CFGR_USBPRE_DIV3                      (0x00400000U)                                     /*!< USBCLK divided by 3 */
#define RCC_CFGR_USBPRE_DIV3P5                    (0x00500000U)                                     /*!< USBCLK divided by 3.5 */
#define RCC_CFGR_USBPRE_DIV4                      (0x00600000U)                                     /*!< USBCLK divided by 4 */
#define RCC_CFGR_SRAM2PRE_Pos                     (23U)
#define RCC_CFGR_SRAM2PRE_Msk                     (0x1UL<<RCC_CFGR_SRAM2PRE_Pos)                    /*!< 0x00800000 */
#define RCC_CFGR_SRAM2PRE                         RCC_CFGR_SRAM2PRE_Msk
#define RCC_CFGR_MCO_Pos                          (24U)
#define RCC_CFGR_MCO_Msk                          (0xFUL<<RCC_CFGR_MCO_Pos)                         /*!< 0x0F000000 */
#define RCC_CFGR_MCO                              RCC_CFGR_MCO_Msk
#define RCC_CFGR_MCO_0                            (0x1UL<<RCC_CFGR_MCO_Pos)                         /*!< 0x01000000 */
#define RCC_CFGR_MCO_1                            (0x2UL<<RCC_CFGR_MCO_Pos)                         /*!< 0x02000000 */
#define RCC_CFGR_MCO_2                            (0x4UL<<RCC_CFGR_MCO_Pos)                         /*!< 0x04000000 */
#define RCC_CFGR_MCO_3                            (0x8UL<<RCC_CFGR_MCO_Pos)                         /*!< 0x08000000 */

#define RCC_CFGR_MCO_NOCLOCK                      0x00000000U                                       /*!< No clock */
#define RCC_CFGR_MCO_LSE                          0x01000000U                                       /*!< LSE selected as MCO source */
#define RCC_CFGR_MCO_LSI                          0x02000000U                                       /*!< LSI selected as MCO source */
#define RCC_CFGR_MCO_HSI48M                       0x03000000U                                       /*!< HSI48 selected as MCO source */
#define RCC_CFGR_MCO_SYSCLK                       0x04000000U                                       /*!< SYSTEM CLOCK selected as MCO source */
#define RCC_CFGR_MCO_HSI16M                       0x05000000U                                       /*!< HSI16M selected as MCO source*/
#define RCC_CFGR_MCO_HSE                          0x06000000U                                       /*!< HSE selected as MCO source*/
#define RCC_CFGR_MCO_PLL                          0x07000000U                                       /*!< PLL selected as MCO source */
#define RCC_CFGR_MCO_HCLK                         0x08000000U                                       /*!< HCLK selected as MCO source */
#define RCC_CFGR_MCO_PCLK1                         0x09000000U                                      /*!< APB1CLK selected as MCO source */
#define RCC_CFGR_MCO_PCLK2                         0x0A000000U                                      /*!< APB2CLK selected as MCO source */
#define RCC_CFGR_MCO_HSI10M                       0x0B000000U                                       /*!< HSI10M selected as MCO source */

/********************************* Bit definition for RCC_CIR register **********************************************/
#define RCC_CIR_LSIRDYF_Pos                       (0U)
#define RCC_CIR_LSIRDYF_Msk                       (0x1UL<<RCC_CIR_LSIRDYF_Pos)                      /*!< 0x00000001 */
#define RCC_CIR_LSIRDYF                           RCC_CIR_LSIRDYF_Msk                               
#define RCC_CIR_LSERDYF_Pos                       (1U)
#define RCC_CIR_LSERDYF_Msk                       (0x1UL<<RCC_CIR_LSERDYF_Pos)                      /*!< 0x00000002 */
#define RCC_CIR_LSERDYF                           RCC_CIR_LSERDYF_Msk                               
#define RCC_CIR_HSIRDYF_Pos                       (2U)
#define RCC_CIR_HSIRDYF_Msk                       (0x1UL<<RCC_CIR_HSIRDYF_Pos)                      /*!< 0x00000004 */
#define RCC_CIR_HSIRDYF                           RCC_CIR_HSIRDYF_Msk                               
#define RCC_CIR_HSERDYF_Pos                       (3U)
#define RCC_CIR_HSERDYF_Msk                       (0x1UL<<RCC_CIR_HSERDYF_Pos)                      /*!< 0x00000008 */
#define RCC_CIR_HSERDYF                           RCC_CIR_HSERDYF_Msk                               
#define RCC_CIR_PLLRDYF_Pos                       (4U)
#define RCC_CIR_PLLRDYF_Msk                       (0x1UL<<RCC_CIR_PLLRDYF_Pos)                      /*!< 0x00000010 */
#define RCC_CIR_PLLRDYF                           RCC_CIR_PLLRDYF_Msk                               
#define RCC_CIR_HSI48RDYF_Pos                     (5U)
#define RCC_CIR_HSI48RDYF_Msk                     (0x1UL<<RCC_CIR_HSI48RDYF_Pos)                    /*!< 0x00000020 */
#define RCC_CIR_HSI48RDYF                         RCC_CIR_HSI48RDYF_Msk                             
#define RCC_CIR_CSSF_Pos                          (7U)
#define RCC_CIR_CSSF_Msk                          (0x1UL<<RCC_CIR_CSSF_Pos)                         /*!< 0x00000080 */
#define RCC_CIR_CSSF                              RCC_CIR_CSSF_Msk                                  
#define RCC_CIR_LSIRDYIE_Pos                      (8U)
#define RCC_CIR_LSIRDYIE_Msk                      (0x1UL<<RCC_CIR_LSIRDYIE_Pos)                     /*!< 0x00000100 */
#define RCC_CIR_LSIRDYIE                          RCC_CIR_LSIRDYIE_Msk                              
#define RCC_CIR_LSERDYIE_Pos                      (9U)
#define RCC_CIR_LSERDYIE_Msk                      (0x1UL<<RCC_CIR_LSERDYIE_Pos)                     /*!< 0x00000200 */
#define RCC_CIR_LSERDYIE                          RCC_CIR_LSERDYIE_Msk                              
#define RCC_CIR_HSIRDYIE_Pos                      (10U)
#define RCC_CIR_HSIRDYIE_Msk                      (0x1UL<<RCC_CIR_HSIRDYIE_Pos)                     /*!< 0x00000400 */
#define RCC_CIR_HSIRDYIE                          RCC_CIR_HSIRDYIE_Msk                              
#define RCC_CIR_HSERDYIE_Pos                      (11U)
#define RCC_CIR_HSERDYIE_Msk                      (0x1UL<<RCC_CIR_HSERDYIE_Pos)                     /*!< 0x00000800 */
#define RCC_CIR_HSERDYIE                          RCC_CIR_HSERDYIE_Msk                              
#define RCC_CIR_PLLRDYIE_Pos                      (12U)
#define RCC_CIR_PLLRDYIE_Msk                      (0x1UL<<RCC_CIR_PLLRDYIE_Pos)                     /*!< 0x00001000 */
#define RCC_CIR_PLLRDYIE                          RCC_CIR_PLLRDYIE_Msk                              
#define RCC_CIR_HSI48RDYIE_Pos                    (13U)
#define RCC_CIR_HSI48RDYIE_Msk                    (0x1UL<<RCC_CIR_HSI48RDYIE_Pos)                   /*!< 0x00002000 */
#define RCC_CIR_HSI48RDYIE                        RCC_CIR_HSI48RDYIE_Msk                            
#define RCC_CIR_LSIRDYC_Pos                       (16U)
#define RCC_CIR_LSIRDYC_Msk                       (0x1UL<<RCC_CIR_LSIRDYC_Pos)                      /*!< 0x00010000 */
#define RCC_CIR_LSIRDYC                           RCC_CIR_LSIRDYC_Msk                               
#define RCC_CIR_LSERDYC_Pos                       (17U)
#define RCC_CIR_LSERDYC_Msk                       (0x1UL<<RCC_CIR_LSERDYC_Pos)                      /*!< 0x00020000 */
#define RCC_CIR_LSERDYC                           RCC_CIR_LSERDYC_Msk                               
#define RCC_CIR_HSIRDYC_Pos                       (18U)
#define RCC_CIR_HSIRDYC_Msk                       (0x1UL<<RCC_CIR_HSIRDYC_Pos)                      /*!< 0x00040000 */
#define RCC_CIR_HSIRDYC                           RCC_CIR_HSIRDYC_Msk                               
#define RCC_CIR_HSERDYC_Pos                       (19U)
#define RCC_CIR_HSERDYC_Msk                       (0x1UL<<RCC_CIR_HSERDYC_Pos)                      /*!< 0x00080000 */
#define RCC_CIR_HSERDYC                           RCC_CIR_HSERDYC_Msk                               
#define RCC_CIR_PLLRDYC_Pos                       (20U)
#define RCC_CIR_PLLRDYC_Msk                       (0x1UL<<RCC_CIR_PLLRDYC_Pos)                      /*!< 0x00100000 */
#define RCC_CIR_PLLRDYC                           RCC_CIR_PLLRDYC_Msk                               
#define RCC_CIR_HSI48RDYC_Pos                     (21U)
#define RCC_CIR_HSI48RDYC_Msk                     (0x1UL<<RCC_CIR_HSI48RDYC_Pos)                    /*!< 0x00200000 */
#define RCC_CIR_HSI48RDYC                         RCC_CIR_HSI48RDYC_Msk                             
#define RCC_CIR_CSSC_Pos                          (23U)
#define RCC_CIR_CSSC_Msk                          (0x1UL<<RCC_CIR_CSSC_Pos)                         /*!< 0x00800000 */
#define RCC_CIR_CSSC                              RCC_CIR_CSSC_Msk                                  

/********************************* Bit definition for RCC_AHB1RSTR register *****************************************/
#define RCC_AHB1RSTR_DMA1RST_Pos                  (0U)
#define RCC_AHB1RSTR_DMA1RST_Msk                  (0x1UL<<RCC_AHB1RSTR_DMA1RST_Pos)                 /*!< 0x00000001 */
#define RCC_AHB1RSTR_DMA1RST                      RCC_AHB1RSTR_DMA1RST_Msk                          
#define RCC_AHB1RSTR_DMA2RST_Pos                  (1U)
#define RCC_AHB1RSTR_DMA2RST_Msk                  (0x1UL<<RCC_AHB1RSTR_DMA2RST_Pos)                 /*!< 0x00000002 */
#define RCC_AHB1RSTR_DMA2RST                      RCC_AHB1RSTR_DMA2RST_Msk                          
#define RCC_AHB1RSTR_CORDICRST_Pos                (5U)
#define RCC_AHB1RSTR_CORDICRST_Msk                (0x1UL<<RCC_AHB1RSTR_CORDICRST_Pos)               /*!< 0x00000020 */
#define RCC_AHB1RSTR_CORDICRST                    RCC_AHB1RSTR_CORDICRST_Msk                        
#define RCC_AHB1RSTR_CRCRST_Pos                   (6U)
#define RCC_AHB1RSTR_CRCRST_Msk                   (0x1UL<<RCC_AHB1RSTR_CRCRST_Pos)                  /*!< 0x00000040 */
#define RCC_AHB1RSTR_CRCRST                       RCC_AHB1RSTR_CRCRST_Msk                           
#define RCC_AHB1RSTR_ESMCRST_Pos                  (12U)
#define RCC_AHB1RSTR_ESMCRST_Msk                  (0x1UL<<RCC_AHB1RSTR_ESMCRST_Pos)                 /*!< 0x00001000 */
#define RCC_AHB1RSTR_ESMCRST                      RCC_AHB1RSTR_ESMCRST_Msk                          

/********************************* Bit definition for RCC_AHB2RSTR register *****************************************/
#define RCC_AHB2RSTR_IOPARST_Pos                  (2U)
#define RCC_AHB2RSTR_IOPARST_Msk                  (0x1UL<<RCC_AHB2RSTR_IOPARST_Pos)                 /*!< 0x00000004 */
#define RCC_AHB2RSTR_IOPARST                      RCC_AHB2RSTR_IOPARST_Msk                          
#define RCC_AHB2RSTR_IOPBRST_Pos                  (3U)
#define RCC_AHB2RSTR_IOPBRST_Msk                  (0x1UL<<RCC_AHB2RSTR_IOPBRST_Pos)                 /*!< 0x00000008 */
#define RCC_AHB2RSTR_IOPBRST                      RCC_AHB2RSTR_IOPBRST_Msk                          
#define RCC_AHB2RSTR_IOPCRST_Pos                  (4U)
#define RCC_AHB2RSTR_IOPCRST_Msk                  (0x1UL<<RCC_AHB2RSTR_IOPCRST_Pos)                 /*!< 0x00000010 */
#define RCC_AHB2RSTR_IOPCRST                      RCC_AHB2RSTR_IOPCRST_Msk                          
#define RCC_AHB2RSTR_IOPDRST_Pos                  (5U)
#define RCC_AHB2RSTR_IOPDRST_Msk                  (0x1UL<<RCC_AHB2RSTR_IOPDRST_Pos)                 /*!< 0x00000020 */
#define RCC_AHB2RSTR_IOPDRST                      RCC_AHB2RSTR_IOPDRST_Msk                          
#define RCC_AHB2RSTR_IOPERST_Pos                  (6U)
#define RCC_AHB2RSTR_IOPERST_Msk                  (0x1UL<<RCC_AHB2RSTR_IOPERST_Pos)                 /*!< 0x00000040 */
#define RCC_AHB2RSTR_IOPERST                      RCC_AHB2RSTR_IOPERST_Msk                          
#define RCC_AHB2RSTR_IOPFRST_Pos                  (7U)
#define RCC_AHB2RSTR_IOPFRST_Msk                  (0x1UL<<RCC_AHB2RSTR_IOPFRST_Pos)                 /*!< 0x00000080 */
#define RCC_AHB2RSTR_IOPFRST                      RCC_AHB2RSTR_IOPFRST_Msk                          
#define RCC_AHB2RSTR_SDIORST_Pos                  (9U)
#define RCC_AHB2RSTR_SDIORST_Msk                  (0x1UL<<RCC_AHB2RSTR_SDIORST_Pos)                 /*!< 0x00000200 */
#define RCC_AHB2RSTR_SDIORST                      RCC_AHB2RSTR_SDIORST_Msk                          
#define RCC_AHB2RSTR_AESRST_Pos                   (10U)
#define RCC_AHB2RSTR_AESRST_Msk                   (0x1UL<<RCC_AHB2RSTR_AESRST_Pos)                  /*!< 0x00000400 */
#define RCC_AHB2RSTR_AESRST                       RCC_AHB2RSTR_AESRST_Msk                           
#define RCC_AHB2RSTR_USB1RST_Pos                  (13U)
#define RCC_AHB2RSTR_USB1RST_Msk                  (0x1UL<<RCC_AHB2RSTR_USB1RST_Pos)                 /*!< 0x00002000 */
#define RCC_AHB2RSTR_USB1RST                      RCC_AHB2RSTR_USB1RST_Msk                          
#define RCC_AHB2RSTR_USB2RST_Pos                  (14U)
#define RCC_AHB2RSTR_USB2RST_Msk                  (0x1UL<<RCC_AHB2RSTR_USB2RST_Pos)                 /*!< 0x00004000 */
#define RCC_AHB2RSTR_USB2RST                      RCC_AHB2RSTR_USB2RST_Msk                          
#define RCC_AHB2RSTR_ETHRST_Pos                   (15U)
#define RCC_AHB2RSTR_ETHRST_Msk                   (0x1UL<<RCC_AHB2RSTR_ETHRST_Pos)                  /*!< 0x00008000 */
#define RCC_AHB2RSTR_ETHRST                       RCC_AHB2RSTR_ETHRST_Msk                           

