Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xC.h
/********************************* Bit definition for TIM_CCER register *********************************************/
#define TIM_CCER_CC1E_Pos                         (0U)
#define TIM_CCER_CC1E_Msk                         (0x1UL<<TIM_CCER_CC1E_Pos)                        /*!< 0x00000001 */
#define TIM_CCER_CC1E                             TIM_CCER_CC1E_Msk                                 
#define TIM_CCER_CC1P_Pos                         (1U)
#define TIM_CCER_CC1P_Msk                         (0x1UL<<TIM_CCER_CC1P_Pos)                        /*!< 0x00000002 */
#define TIM_CCER_CC1P                             TIM_CCER_CC1P_Msk                                 
#define TIM_CCER_CC1NE_Pos                        (2U)
#define TIM_CCER_CC1NE_Msk                        (0x1UL<<TIM_CCER_CC1NE_Pos)                       /*!< 0x00000004 */
#define TIM_CCER_CC1NE                            TIM_CCER_CC1NE_Msk                                
#define TIM_CCER_CC1NP_Pos                        (3U)
#define TIM_CCER_CC1NP_Msk                        (0x1UL<<TIM_CCER_CC1NP_Pos)                       /*!< 0x00000008 */
#define TIM_CCER_CC1NP                            TIM_CCER_CC1NP_Msk                                
#define TIM_CCER_CC2E_Pos                         (4U)
#define TIM_CCER_CC2E_Msk                         (0x1UL<<TIM_CCER_CC2E_Pos)                        /*!< 0x00000010 */
#define TIM_CCER_CC2E                             TIM_CCER_CC2E_Msk                                 
#define TIM_CCER_CC2P_Pos                         (5U)
#define TIM_CCER_CC2P_Msk                         (0x1UL<<TIM_CCER_CC2P_Pos)                        /*!< 0x00000020 */
#define TIM_CCER_CC2P                             TIM_CCER_CC2P_Msk                                 
#define TIM_CCER_CC2NE_Pos                        (6U)
#define TIM_CCER_CC2NE_Msk                        (0x1UL<<TIM_CCER_CC2NE_Pos)                       /*!< 0x00000040 */
#define TIM_CCER_CC2NE                            TIM_CCER_CC2NE_Msk                                
#define TIM_CCER_CC2NP_Pos                        (7U)
#define TIM_CCER_CC2NP_Msk                        (0x1UL<<TIM_CCER_CC2NP_Pos)                       /*!< 0x00000080 */
#define TIM_CCER_CC2NP                            TIM_CCER_CC2NP_Msk                                
#define TIM_CCER_CC3E_Pos                         (8U)
#define TIM_CCER_CC3E_Msk                         (0x1UL<<TIM_CCER_CC3E_Pos)                        /*!< 0x00000100 */
#define TIM_CCER_CC3E                             TIM_CCER_CC3E_Msk                                 
#define TIM_CCER_CC3P_Pos                         (9U)
#define TIM_CCER_CC3P_Msk                         (0x1UL<<TIM_CCER_CC3P_Pos)                        /*!< 0x00000200 */
#define TIM_CCER_CC3P                             TIM_CCER_CC3P_Msk                                 
#define TIM_CCER_CC3NE_Pos                        (10U)
#define TIM_CCER_CC3NE_Msk                        (0x1UL<<TIM_CCER_CC3NE_Pos)                       /*!< 0x00000400 */
#define TIM_CCER_CC3NE                            TIM_CCER_CC3NE_Msk                                
#define TIM_CCER_CC3NP_Pos                        (11U)
#define TIM_CCER_CC3NP_Msk                        (0x1UL<<TIM_CCER_CC3NP_Pos)                       /*!< 0x00000800 */
#define TIM_CCER_CC3NP                            TIM_CCER_CC3NP_Msk                                
#define TIM_CCER_CC4E_Pos                         (12U)
#define TIM_CCER_CC4E_Msk                         (0x1UL<<TIM_CCER_CC4E_Pos)                        /*!< 0x00001000 */
#define TIM_CCER_CC4E                             TIM_CCER_CC4E_Msk                                 
#define TIM_CCER_CC4P_Pos                         (13U)
#define TIM_CCER_CC4P_Msk                         (0x1UL<<TIM_CCER_CC4P_Pos)                        /*!< 0x00002000 */
#define TIM_CCER_CC4P                             TIM_CCER_CC4P_Msk                                 
#define TIM_CCER_CC4NE_Pos                        (14U)
#define TIM_CCER_CC4NE_Msk                        (0x1UL<<TIM_CCER_CC4NE_Pos)                       /*!< 0x00004000 */
#define TIM_CCER_CC4NE                            TIM_CCER_CC4NE_Msk                                
#define TIM_CCER_CC4NP_Pos                        (15U)
#define TIM_CCER_CC4NP_Msk                        (0x1UL<<TIM_CCER_CC4NP_Pos)                       /*!< 0x00008000 */
#define TIM_CCER_CC4NP                            TIM_CCER_CC4NP_Msk                                
#define TIM_CCER_CC5E_Pos                         (16U)
#define TIM_CCER_CC5E_Msk                         (0x1UL<<TIM_CCER_CC5E_Pos)                        /*!< 0x00010000 */
#define TIM_CCER_CC5E                             TIM_CCER_CC5E_Msk                                 
#define TIM_CCER_CC5P_Pos                         (17U)
#define TIM_CCER_CC5P_Msk                         (0x1UL<<TIM_CCER_CC5P_Pos)                        /*!< 0x00020000 */
#define TIM_CCER_CC5P                             TIM_CCER_CC5P_Msk                                 
#define TIM_CCER_CC6E_Pos                         (20U)
#define TIM_CCER_CC6E_Msk                         (0x1UL<<TIM_CCER_CC6E_Pos)                        /*!< 0x00100000 */
#define TIM_CCER_CC6E                             TIM_CCER_CC6E_Msk                                 
#define TIM_CCER_CC6P_Pos                         (21U)
#define TIM_CCER_CC6P_Msk                         (0x1UL<<TIM_CCER_CC6P_Pos)                        /*!< 0x00200000 */
#define TIM_CCER_CC6P                             TIM_CCER_CC6P_Msk                                 

/********************************* Bit definition for TIM_CNT register *********************************************/
#define TIM_CNT_CNT_Pos                          (0U)
#define TIM_CNT_CNT_Msk                          (0xFFFFUL<<TIM_CNT_CNT_Pos)                      /*!< 0x0000FFFF */
#define TIM_CNT_CNT                              TIM_CNT_CNT_Msk
#define TIM_CNT_UIFCPY_Pos                       (31U)
#define TIM_CNT_UIFCPY_Msk                       (0x1UL<<TIM_CNT_UIFCPY_Pos)                      /*!< 0x80000000 */
#define TIM_CNT_UIFCPY                           TIM_CNT_UIFCPY_Msk                               

/********************************* Bit definition for TIM_PSC register *********************************************/
#define TIM_PSC_PSC_Pos                          (0U)
#define TIM_PSC_PSC_Msk                          (0xFFFFUL<<TIM_PSC_PSC_Pos)                      /*!< 0x0000FFFF */
#define TIM_PSC_PSC                              TIM_PSC_PSC_Msk

