Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xC.h
/********************************* Bit definition for TIM_CCR6 register ********************************************/
#define TIM_CCR6_CCR6_Pos                        (0U)
#define TIM_CCR6_CCR6_Msk                        (0xFFFFFUL<<TIM_CCR6_CCR6_Pos)                   /*!< 0x000FFFFF */
#define TIM_CCR6_CCR6                            TIM_CCR6_CCR6_Msk

/********************************* Bit definition for TIM_CCMR3 register *******************************************/
#define TIM_CCMR3_TI1SEL_Pos                     (0U)
#define TIM_CCMR3_TI1SEL_Msk                     (0x3UL<<TIM_CCMR3_TI1SEL_Pos)                    /*!< 0x00000003 */
#define TIM_CCMR3_TI1SEL                         TIM_CCMR3_TI1SEL_Msk
#define TIM_CCMR3_TI1SEL_0                       (0x1UL<<TIM_CCMR3_TI1SEL_Pos)                    /*!< 0x00000001 */
#define TIM_CCMR3_TI1SEL_1                       (0x2UL<<TIM_CCMR3_TI1SEL_Pos)                    /*!< 0x00000002 */


#define TIM_CCMR3_OC5FE_Pos                      (2U)
#define TIM_CCMR3_OC5FE_Msk                      (0x1UL<<TIM_CCMR3_OC5FE_Pos)                     /*!< 0x00000004 */
#define TIM_CCMR3_OC5FE                          TIM_CCMR3_OC5FE_Msk                              
#define TIM_CCMR3_OC5PE_Pos                      (3U)
#define TIM_CCMR3_OC5PE_Msk                      (0x1UL<<TIM_CCMR3_OC5PE_Pos)                     /*!< 0x00000008 */
#define TIM_CCMR3_OC5PE                          TIM_CCMR3_OC5PE_Msk                              
#define TIM_CCMR3_OC5M_Pos                       (4U)
#define TIM_CCMR3_OC5M_Msk                       (0x1007UL<<TIM_CCMR3_OC5M_Pos)                   /*!< 0x00010070 */
#define TIM_CCMR3_OC5M                           TIM_CCMR3_OC5M_Msk
#define TIM_CCMR3_OC5M_0                         (0x1UL<<TIM_CCMR3_OC5M_Pos)                      /*!< 0x00000010 */
#define TIM_CCMR3_OC5M_1                         (0x2UL<<TIM_CCMR3_OC5M_Pos)                      /*!< 0x00000020 */
#define TIM_CCMR3_OC5M_2                         (0x4UL<<TIM_CCMR3_OC5M_Pos)                      /*!< 0x00000040 */
#define TIM_CCMR3_OC5M_3                         (0x1000UL<<TIM_CCMR3_OC5M_Pos)                   /*!< 0x00010000 */
#define TIM_CCMR3_OC5CE_Pos                      (7U)
#define TIM_CCMR3_OC5CE_Msk                      (0x1UL<<TIM_CCMR3_OC5CE_Pos)                     /*!< 0x00000080 */
#define TIM_CCMR3_OC5CE                          TIM_CCMR3_OC5CE_Msk                              
#define TIM_CCMR3_OC6FE_Pos                      (10U)
#define TIM_CCMR3_OC6FE_Msk                      (0x1UL<<TIM_CCMR3_OC6FE_Pos)                     /*!< 0x00000400 */
#define TIM_CCMR3_OC6FE                          TIM_CCMR3_OC6FE_Msk                              
#define TIM_CCMR3_OC6PE_Pos                      (11U)
#define TIM_CCMR3_OC6PE_Msk                      (0x1UL<<TIM_CCMR3_OC6PE_Pos)                     /*!< 0x00000800 */
#define TIM_CCMR3_OC6PE                          TIM_CCMR3_OC6PE_Msk                              
#define TIM_CCMR3_OC6M_Pos                       (12U)
#define TIM_CCMR3_OC6M_Msk                       (0x1007UL<<TIM_CCMR3_OC6M_Pos)                   /*!< 0x01007000 */
#define TIM_CCMR3_OC6M                           TIM_CCMR3_OC6M_Msk
#define TIM_CCMR3_OC6M_0                         (0x1UL<<TIM_CCMR3_OC6M_Pos)                      /*!< 0x00001000 */
#define TIM_CCMR3_OC6M_1                         (0x2UL<<TIM_CCMR3_OC6M_Pos)                      /*!< 0x00002000 */
#define TIM_CCMR3_OC6M_2                         (0x4UL<<TIM_CCMR3_OC6M_Pos)                      /*!< 0x00004000 */
#define TIM_CCMR3_OC6M_3                         (0x1000UL<<TIM_CCMR3_OC6M_Pos)                   /*!< 0x01000000 */
#define TIM_CCMR3_OC6CE_Pos                      (15U)
#define TIM_CCMR3_OC6CE_Msk                      (0x1UL<<TIM_CCMR3_OC6CE_Pos)                     /*!< 0x00008000 */
#define TIM_CCMR3_OC6CE                          TIM_CCMR3_OC6CE_Msk                              

/********************************* Bit definition for TIM_DTR2 register ********************************************/
#define TIM_DTR2_DTGF_Pos                        (0U)
#define TIM_DTR2_DTGF_Msk                        (0xFFUL<<TIM_DTR2_DTGF_Pos)                      /*!< 0x000000FF */
#define TIM_DTR2_DTGF                            TIM_DTR2_DTGF_Msk
#define TIM_DTR2_DTAE_Pos                        (16U)
#define TIM_DTR2_DTAE_Msk                        (0x1UL<<TIM_DTR2_DTAE_Pos)                       /*!< 0x00010000 */
#define TIM_DTR2_DTAE                            TIM_DTR2_DTAE_Msk                                
#define TIM_DTR2_DTPE_Pos                        (17U)
#define TIM_DTR2_DTPE_Msk                        (0x1UL<<TIM_DTR2_DTPE_Pos)                       /*!< 0x00020000 */
#define TIM_DTR2_DTPE                            TIM_DTR2_DTPE_Msk                                

/********************************* Bit definition for TIM_ECR register *********************************************/
#define TIM_ECR_IE_Pos                           (0U)
#define TIM_ECR_IE_Msk                           (0x1UL<<TIM_ECR_IE_Pos)                          /*!< 0x00000001 */
#define TIM_ECR_IE                               TIM_ECR_IE_Msk                                   
#define TIM_ECR_IDIR_Pos                         (1U)
#define TIM_ECR_IDIR_Msk                         (0x3UL<<TIM_ECR_IDIR_Pos)                        /*!< 0x00000006 */
#define TIM_ECR_IDIR                             TIM_ECR_IDIR_Msk  
#define TIM_ECR_IDIR_0                           (0x1UL<<TIM_ECR_IDIR_Pos)                        /*!< 0x00000002 */
#define TIM_ECR_IDIR_1                           (0x2UL<<TIM_ECR_IDIR_Pos)                        /*!< 0x00000004 */
#define TIM_ECR_FIDX_Pos                         (5U)
#define TIM_ECR_FIDX_Msk                         (0x1UL<<TIM_ECR_FIDX_Pos)                        /*!< 0x00000020 */
#define TIM_ECR_FIDX                             TIM_ECR_FIDX_Msk                                 
#define TIM_ECR_IPOS_Pos                         (6U)
#define TIM_ECR_IPOS_Msk                         (0x3UL<<TIM_ECR_IPOS_Pos)                        /*!< 0x000000C0 */
#define TIM_ECR_IPOS                             TIM_ECR_IPOS_Msk
#define TIM_ECR_IPOS_0                           (0x1UL<<TIM_ECR_IPOS_Pos)                        /*!< 0x00000040 */
#define TIM_ECR_IPOS_1                           (0x2UL<<TIM_ECR_IPOS_Pos)                        /*!< 0x00000080 */
#define TIM_ECR_PW_Pos                           (16U)
#define TIM_ECR_PW_Msk                           (0xFFUL<<TIM_ECR_PW_Pos)                         /*!< 0x00FF0000 */
#define TIM_ECR_PW                               TIM_ECR_PW_Msk
#define TIM_ECR_PWPRSC_Pos                       (24U)
#define TIM_ECR_PWPRSC_Msk                       (0x7UL<<TIM_ECR_PWPRSC_Pos)                      /*!< 0x07000000 */
#define TIM_ECR_PWPRSC                           TIM_ECR_PWPRSC_Msk
#define TIM_ECR_PWPRSC_0                         (0x1UL<<TIM_ECR_PWPRSC_Pos)                      /*!< 0x01000000 */
#define TIM_ECR_PWPRSC_1                         (0x2UL<<TIM_ECR_PWPRSC_Pos)                      /*!< 0x02000000 */
#define TIM_ECR_PWPRSC_2                         (0x4UL<<TIM_ECR_PWPRSC_Pos)                      /*!< 0x04000000 */

/********************************* Bit definition for TIM_TISEL register *******************************************/
#define TIM_TISEL_TI1SEL_Pos                     (0U)
#define TIM_TISEL_TI1SEL_Msk                     (0xFUL<<TIM_TISEL_TI1SEL_Pos)                    /*!< 0x0000000F */
#define TIM_TISEL_TI1SEL                         TIM_TISEL_TI1SEL_Msk
#define TIM_TISEL_TI1SEL_0                       (0x1UL<<TIM_TISEL_TI1SEL_Pos)                    /*!< 0x00000001 */
#define TIM_TISEL_TI1SEL_1                       (0x2UL<<TIM_TISEL_TI1SEL_Pos)                    /*!< 0x00000002 */
#define TIM_TISEL_TI1SEL_2                       (0x4UL<<TIM_TISEL_TI1SEL_Pos)                    /*!< 0x00000004 */
#define TIM_TISEL_TI1SEL_3                       (0x8UL<<TIM_TISEL_TI1SEL_Pos)                    /*!< 0x00000008 */
#define TIM_TISEL_TI2SEL_Pos                     (8U)
#define TIM_TISEL_TI2SEL_Msk                     (0xFUL<<TIM_TISEL_TI2SEL_Pos)                    /*!< 0x00000F00 */
#define TIM_TISEL_TI2SEL                         TIM_TISEL_TI2SEL_Msk
#define TIM_TISEL_TI2SEL_0                       (0x1UL<<TIM_TISEL_TI2SEL_Pos)                    /*!< 0x00000100 */
#define TIM_TISEL_TI2SEL_1                       (0x2UL<<TIM_TISEL_TI2SEL_Pos)                    /*!< 0x00000200 */
#define TIM_TISEL_TI2SEL_2                       (0x4UL<<TIM_TISEL_TI2SEL_Pos)                    /*!< 0x00000400 */
#define TIM_TISEL_TI2SEL_3                       (0x8UL<<TIM_TISEL_TI2SEL_Pos)                    /*!< 0x00000800 */
#define TIM_TISEL_TI3SEL_Pos                     (16U)
#define TIM_TISEL_TI3SEL_Msk                     (0xFUL<<TIM_TISEL_TI3SEL_Pos)                    /*!< 0x000F0000 */
#define TIM_TISEL_TI3SEL                         TIM_TISEL_TI3SEL_Msk
#define TIM_TISEL_TI3SEL_0                       (0x1UL<<TIM_TISEL_TI3SEL_Pos)                    /*!< 0x00010000 */
#define TIM_TISEL_TI3SEL_1                       (0x2UL<<TIM_TISEL_TI3SEL_Pos)                    /*!< 0x00020000 */
#define TIM_TISEL_TI3SEL_2                       (0x4UL<<TIM_TISEL_TI3SEL_Pos)                    /*!< 0x00040000 */
#define TIM_TISEL_TI3SEL_3                       (0x8UL<<TIM_TISEL_TI3SEL_Pos)                    /*!< 0x00080000 */
#define TIM_TISEL_TI4SEL_Pos                     (24U)
#define TIM_TISEL_TI4SEL_Msk                     (0xFUL<<TIM_TISEL_TI4SEL_Pos)                    /*!< 0x0F000000 */
#define TIM_TISEL_TI4SEL                         TIM_TISEL_TI4SEL_Msk
#define TIM_TISEL_TI4SEL_0                       (0x1UL<<TIM_TISEL_TI4SEL_Pos)                    /*!< 0x01000000 */
#define TIM_TISEL_TI4SEL_1                       (0x2UL<<TIM_TISEL_TI4SEL_Pos)                    /*!< 0x02000000 */
#define TIM_TISEL_TI4SEL_2                       (0x4UL<<TIM_TISEL_TI4SEL_Pos)                    /*!< 0x04000000 */
#define TIM_TISEL_TI4SEL_3                       (0x8UL<<TIM_TISEL_TI4SEL_Pos)                    /*!< 0x08000000 */

/********************************* Bit definition for TIM1_AF1 register *********************************************/
#define TIM1_AF1_BKINE_Pos                        (0U)
#define TIM1_AF1_BKINE_Msk                        (0x1UL << TIM1_AF1_BKINE_Pos)                    /*!< 0x00000001 */
#define TIM1_AF1_BKINE                            TIM1_AF1_BKINE_Msk                               /*!<BRK BKIN input enable */
#define TIM1_AF1_BKCMP1E_Pos                      (1U)
#define TIM1_AF1_BKCMP1E_Msk                      (0x1UL << TIM1_AF1_BKCMP1E_Pos)                  /*!< 0x00000002 */
#define TIM1_AF1_BKCMP1E                          TIM1_AF1_BKCMP1E_Msk                             /*!<BRK COMP1 enable */
#define TIM1_AF1_BKCMP2E_Pos                      (2U)
#define TIM1_AF1_BKCMP2E_Msk                      (0x1UL << TIM1_AF1_BKCMP2E_Pos)                  /*!< 0x00000004 */
#define TIM1_AF1_BKCMP2E                          TIM1_AF1_BKCMP2E_Msk                             /*!<BRK COMP2 enable */
#define TIM1_AF1_BKCMP3E_Pos                      (3U)
#define TIM1_AF1_BKCMP3E_Msk                      (0x1UL << TIM1_AF1_BKCMP3E_Pos)                  /*!< 0x00000008 */
#define TIM1_AF1_BKCMP3E                          TIM1_AF1_BKCMP3E_Msk                             /*!<BRK COMP3 enable */
#define TIM1_AF1_BKCMP4E_Pos                      (4U)
#define TIM1_AF1_BKCMP4E_Msk                      (0x1UL << TIM1_AF1_BKCMP4E_Pos)                  /*!< 0x00000010 */
#define TIM1_AF1_BKCMP4E                          TIM1_AF1_BKCMP4E_Msk                             /*!<BRK COMP4 enable */
#define TIM1_AF1_BKINP_Pos                        (9U)
#define TIM1_AF1_BKINP_Msk                        (0x1UL << TIM1_AF1_BKINP_Pos)                    /*!< 0x00000200 */
#define TIM1_AF1_BKINP                            TIM1_AF1_BKINP_Msk                               /*!<BRK BKIN input polarity */
#define TIM1_AF1_BKCMP1P_Pos                      (10U)
#define TIM1_AF1_BKCMP1P_Msk                      (0x1UL << TIM1_AF1_BKCMP1P_Pos)                  /*!< 0x00000400 */
#define TIM1_AF1_BKCMP1P                          TIM1_AF1_BKCMP1P_Msk                             /*!<BRK COMP1 input polarity */
#define TIM1_AF1_BKCMP2P_Pos                      (11U)
#define TIM1_AF1_BKCMP2P_Msk                      (0x1UL << TIM1_AF1_BKCMP2P_Pos)                  /*!< 0x00000800 */
#define TIM1_AF1_BKCMP2P                          TIM1_AF1_BKCMP2P_Msk                             /*!<BRK COMP2 input polarity */
#define TIM1_AF1_BKCMP3P_Pos                      (12U)
#define TIM1_AF1_BKCMP3P_Msk                      (0x1UL << TIM1_AF1_BKCMP3P_Pos)                  /*!< 0x00001000 */
#define TIM1_AF1_BKCMP3P                          TIM1_AF1_BKCMP3P_Msk                             /*!<BRK COMP3 input polarity */
#define TIM1_AF1_BKCMP4P_Pos                      (13U)
#define TIM1_AF1_BKCMP4P_Msk                      (0x1UL << TIM1_AF1_BKCMP4P_Pos)                  /*!< 0x00002000 */
#define TIM1_AF1_BKCMP4P                          TIM1_AF1_BKCMP4P_Msk                             /*!<BRK COMP4 input polarity */
#define TIM1_AF1_ETRSEL_Pos                       (14U)
#define TIM1_AF1_ETRSEL_Msk                       (0xFUL << TIM1_AF1_ETRSEL_Pos)                   /*!< 0x0003C000 */
#define TIM1_AF1_ETRSEL                           TIM1_AF1_ETRSEL_Msk                              /*!<ETRSEL[3:0] bits (TIM1 ETR source selection) */
#define TIM1_AF1_ETRSEL_0                         (0x1UL << TIM1_AF1_ETRSEL_Pos)                   /*!< 0x00004000 */
#define TIM1_AF1_ETRSEL_1                         (0x2UL << TIM1_AF1_ETRSEL_Pos)                   /*!< 0x00008000 */
#define TIM1_AF1_ETRSEL_2                         (0x4UL << TIM1_AF1_ETRSEL_Pos)                   /*!< 0x00010000 */
#define TIM1_AF1_ETRSEL_3                         (0x8UL << TIM1_AF1_ETRSEL_Pos)                   /*!< 0x00020000 */

/********************************* Bit definition for TIM1_AF2 register *********************************************/
#define TIM1_AF2_BK2INE_Pos                       (0U)
#define TIM1_AF2_BK2INE_Msk                       (0x1UL << TIM1_AF2_BK2INE_Pos)                    /*!< 0x00000001 */
#define TIM1_AF2_BK2INE                           TIM1_AF2_BK2INE_Msk                               /*!<BRK2 BKIN input enable */
#define TIM1_AF2_BK2CMP1E_Pos                     (1U)
#define TIM1_AF2_BK2CMP1E_Msk                     (0x1UL << TIM1_AF2_BK2CMP1E_Pos)                  /*!< 0x00000002 */
#define TIM1_AF2_BK2CMP1E                         TIM1_AF2_BK2CMP1E_Msk                             /*!<BRK2 COMP1 enable */
#define TIM1_AF2_BK2CMP2E_Pos                     (2U)
#define TIM1_AF2_BK2CMP2E_Msk                     (0x1UL << TIM1_AF2_BK2CMP2E_Pos)                  /*!< 0x00000004 */
#define TIM1_AF2_BK2CMP2E                         TIM1_AF2_BK2CMP2E_Msk                             /*!<BRK2 COMP2 enable */
#define TIM1_AF2_BK2CMP3E_Pos                     (3U)
#define TIM1_AF2_BK2CMP3E_Msk                     (0x1UL << TIM1_AF2_BK2CMP3E_Pos)                  /*!< 0x00000008 */
#define TIM1_AF2_BK2CMP3E                         TIM1_AF2_BK2CMP3E_Msk                             /*!<BRK2 COMP3 enable */
#define TIM1_AF2_BK2CMP4E_Pos                     (4U)
#define TIM1_AF2_BK2CMP4E_Msk                     (0x1UL << TIM1_AF2_BK2CMP4E_Pos)                  /*!< 0x00000010 */
#define TIM1_AF2_BK2CMP4E                         TIM1_AF2_BK2CMP4E_Msk                             /*!<BRK2 COMP4 enable */
#define TIM1_AF2_BK2INP_Pos                       (9U)
#define TIM1_AF2_BK2INP_Msk                       (0x1UL << TIM1_AF2_BK2INP_Pos)                    /*!< 0x00000200 */
#define TIM1_AF2_BK2INP                           TIM1_AF2_BK2INP_Msk                               /*!<BRK2 BKIN input polarity */
#define TIM1_AF2_BK2CMP1P_Pos                     (10U)
#define TIM1_AF2_BK2CMP1P_Msk                     (0x1UL << TIM1_AF2_BK2CMP1P_Pos)                  /*!< 0x00000400 */
#define TIM1_AF2_BK2CMP1P                         TIM1_AF2_BK2CMP1P_Msk                             /*!<BRK2 COMP1 input polarity */
#define TIM1_AF2_BK2CMP2P_Pos                     (11U)
#define TIM1_AF2_BK2CMP2P_Msk                     (0x1UL << TIM1_AF2_BK2CMP2P_Pos)                  /*!< 0x00000800 */
#define TIM1_AF2_BK2CMP2P                         TIM1_AF2_BK2CMP2P_Msk                             /*!<BRK2 COMP2 input polarity */
#define TIM1_AF2_BK2CMP3P_Pos                     (12U)
#define TIM1_AF2_BK2CMP3P_Msk                     (0x1UL << TIM1_AF2_BK2CMP3P_Pos)                  /*!< 0x00000400 */
#define TIM1_AF2_BK2CMP3P                         TIM1_AF2_BK2CMP3P_Msk                             /*!<BRK2 COMP3 input polarity */
#define TIM1_AF2_BK2CMP4P_Pos                     (13U)
#define TIM1_AF2_BK2CMP4P_Msk                     (0x1UL << TIM1_AF2_BK2CMP4P_Pos)                  /*!< 0x00000800 */
#define TIM1_AF2_BK2CMP4P                         TIM1_AF2_BK2CMP4P_Msk                             /*!<BRK2 COMP4 input polarity */
#define TIM1_AF2_OCRSEL_Pos                       (16U)
#define TIM1_AF2_OCRSEL_Msk                       (0x7UL << TIM1_AF2_OCRSEL_Pos)                    /*!< 0x00070000 */
#define TIM1_AF2_OCRSEL                           TIM1_AF2_OCRSEL_Msk                               /*!<BRK2 COMP2 input polarity */
#define TIM1_AF2_OCRSEL_0                         (0x1UL << TIM1_AF2_OCRSEL_Pos)                    /*!< 0x00010000 */
#define TIM1_AF2_OCRSEL_1                         (0x2UL << TIM1_AF2_OCRSEL_Pos)                    /*!< 0x00020000 */
#define TIM1_AF2_OCRSEL_2                         (0x4UL << TIM1_AF2_OCRSEL_Pos)                    /*!< 0x00040000 */

